XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
/* 0x12 : Response Register 1 */
#define SDH_SD_RESP_1_OFFSET (0x12)
#define SDH_RESP1            SDH_RESP1
#define SDH_RESP1_POS        (0U)
#define SDH_RESP1_LEN        (16U)
#define SDH_RESP1_MSK        (((1U << SDH_RESP1_LEN) - 1) << SDH_RESP1_POS)
#define SDH_RESP1_UMSK       (~(((1U << SDH_RESP1_LEN) - 1) << SDH_RESP1_POS))

/* 0x14 : Response Register 2 */
#define SDH_SD_RESP_2_OFFSET (0x14)
#define SDH_RESP2            SDH_RESP2
#define SDH_RESP2_POS        (0U)
#define SDH_RESP2_LEN        (16U)
#define SDH_RESP2_MSK        (((1U << SDH_RESP2_LEN) - 1) << SDH_RESP2_POS)
#define SDH_RESP2_UMSK       (~(((1U << SDH_RESP2_LEN) - 1) << SDH_RESP2_POS))

/* 0x16 : Response Register 3 */
#define SDH_SD_RESP_3_OFFSET (0x16)
#define SDH_RESP3            SDH_RESP3
#define SDH_RESP3_POS        (0U)
#define SDH_RESP3_LEN        (16U)
#define SDH_RESP3_MSK        (((1U << SDH_RESP3_LEN) - 1) << SDH_RESP3_POS)
#define SDH_RESP3_UMSK       (~(((1U << SDH_RESP3_LEN) - 1) << SDH_RESP3_POS))

/* 0x18 : Response Register 4 */
#define SDH_SD_RESP_4_OFFSET (0x18)
#define SDH_RESP4            SDH_RESP4
#define SDH_RESP4_POS        (0U)
#define SDH_RESP4_LEN        (16U)
#define SDH_RESP4_MSK        (((1U << SDH_RESP4_LEN) - 1) << SDH_RESP4_POS)
#define SDH_RESP4_UMSK       (~(((1U << SDH_RESP4_LEN) - 1) << SDH_RESP4_POS))

/* 0x1A : Response Register 5 */
#define SDH_SD_RESP_5_OFFSET (0x1A)
#define SDH_RESP5            SDH_RESP5
#define SDH_RESP5_POS        (0U)
#define SDH_RESP5_LEN        (16U)
#define SDH_RESP5_MSK        (((1U << SDH_RESP5_LEN) - 1) << SDH_RESP5_POS)
#define SDH_RESP5_UMSK       (~(((1U << SDH_RESP5_LEN) - 1) << SDH_RESP5_POS))

/* 0x1C : Response Register 6 */
#define SDH_SD_RESP_6_OFFSET (0x1C)
#define SDH_RESP6            SDH_RESP6
#define SDH_RESP6_POS        (0U)
#define SDH_RESP6_LEN        (16U)
#define SDH_RESP6_MSK        (((1U << SDH_RESP6_LEN) - 1) << SDH_RESP6_POS)
#define SDH_RESP6_UMSK       (~(((1U << SDH_RESP6_LEN) - 1) << SDH_RESP6_POS))

/* 0x1E : Response Register 7 */
#define SDH_SD_RESP_7_OFFSET (0x1E)
#define SDH_RESP7            SDH_RESP7
#define SDH_RESP7_POS        (0U)
#define SDH_RESP7_LEN        (16U)
#define SDH_RESP7_MSK        (((1U << SDH_RESP7_LEN) - 1) << SDH_RESP7_POS)
#define SDH_RESP7_UMSK       (~(((1U << SDH_RESP7_LEN) - 1) << SDH_RESP7_POS))

/* 0x20 : Buffer Data Port 0 Register */
#define SDH_SD_BUFFER_DATA_PORT_0_OFFSET (0x20)
#define SDH_CPU_DATA0                    SDH_CPU_DATA0
#define SDH_CPU_DATA0_POS                (0U)
#define SDH_CPU_DATA0_LEN                (16U)
#define SDH_CPU_DATA0_MSK                (((1U << SDH_CPU_DATA0_LEN) - 1) << SDH_CPU_DATA0_POS)
#define SDH_CPU_DATA0_UMSK               (~(((1U << SDH_CPU_DATA0_LEN) - 1) << SDH_CPU_DATA0_POS))

/* 0x22 : Buffer Data Port 1 Register */
#define SDH_SD_BUFFER_DATA_PORT_1_OFFSET (0x22)
#define SDH_CPU_DATA1                    SDH_CPU_DATA1
#define SDH_CPU_DATA1_POS                (0U)
#define SDH_CPU_DATA1_LEN                (16U)
#define SDH_CPU_DATA1_MSK                (((1U << SDH_CPU_DATA1_LEN) - 1) << SDH_CPU_DATA1_POS)
#define SDH_CPU_DATA1_UMSK               (~(((1U << SDH_CPU_DATA1_LEN) - 1) << SDH_CPU_DATA1_POS))

/* 0x24 : Present State Register 1 */
#define SDH_SD_PRESENT_STATE_1_OFFSET (0x24)
#define SDH_CMD_INHIBIT_CMD           SDH_CMD_INHIBIT_CMD
#define SDH_CMD_INHIBIT_CMD_POS       (0U)
#define SDH_CMD_INHIBIT_CMD_LEN       (1U)
#define SDH_CMD_INHIBIT_CMD_MSK       (((1U << SDH_CMD_INHIBIT_CMD_LEN) - 1) << SDH_CMD_INHIBIT_CMD_POS)
#define SDH_CMD_INHIBIT_CMD_UMSK      (~(((1U << SDH_CMD_INHIBIT_CMD_LEN) - 1) << SDH_CMD_INHIBIT_CMD_POS))
#define SDH_CMD_INHIBIT_DAT           SDH_CMD_INHIBIT_DAT
#define SDH_CMD_INHIBIT_DAT_POS       (1U)
#define SDH_CMD_INHIBIT_DAT_LEN       (1U)
#define SDH_CMD_INHIBIT_DAT_MSK       (((1U << SDH_CMD_INHIBIT_DAT_LEN) - 1) << SDH_CMD_INHIBIT_DAT_POS)
#define SDH_CMD_INHIBIT_DAT_UMSK      (~(((1U << SDH_CMD_INHIBIT_DAT_LEN) - 1) << SDH_CMD_INHIBIT_DAT_POS))
#define SDH__DAT_ACTIVE               SDH__DAT_ACTIVE
#define SDH__DAT_ACTIVE_POS           (2U)
#define SDH__DAT_ACTIVE_LEN           (1U)
#define SDH__DAT_ACTIVE_MSK           (((1U << SDH__DAT_ACTIVE_LEN) - 1) << SDH__DAT_ACTIVE_POS)
#define SDH__DAT_ACTIVE_UMSK          (~(((1U << SDH__DAT_ACTIVE_LEN) - 1) << SDH__DAT_ACTIVE_POS))
#define SDH_RETUNING_REQ              SDH_RETUNING_REQ
#define SDH_RETUNING_REQ_POS          (3U)
#define SDH_RETUNING_REQ_LEN          (1U)
#define SDH_RETUNING_REQ_MSK          (((1U << SDH_RETUNING_REQ_LEN) - 1) << SDH_RETUNING_REQ_POS)
#define SDH_RETUNING_REQ_UMSK         (~(((1U << SDH_RETUNING_REQ_LEN) - 1) << SDH_RETUNING_REQ_POS))
#define SDH_TX_ACTIVE                 SDH_TX_ACTIVE
#define SDH_TX_ACTIVE_POS             (8U)
#define SDH_TX_ACTIVE_LEN             (1U)
#define SDH_TX_ACTIVE_MSK             (((1U << SDH_TX_ACTIVE_LEN) - 1) << SDH_TX_ACTIVE_POS)
#define SDH_TX_ACTIVE_UMSK            (~(((1U << SDH_TX_ACTIVE_LEN) - 1) << SDH_TX_ACTIVE_POS))
#define SDH_RX_ACTIVE                 SDH_RX_ACTIVE
#define SDH_RX_ACTIVE_POS             (9U)
#define SDH_RX_ACTIVE_LEN             (1U)
#define SDH_RX_ACTIVE_MSK             (((1U << SDH_RX_ACTIVE_LEN) - 1) << SDH_RX_ACTIVE_POS)
#define SDH_RX_ACTIVE_UMSK            (~(((1U << SDH_RX_ACTIVE_LEN) - 1) << SDH_RX_ACTIVE_POS))
#define SDH_BUFFER_WR_EN              SDH_BUFFER_WR_EN
#define SDH_BUFFER_WR_EN_POS          (10U)
#define SDH_BUFFER_WR_EN_LEN          (1U)
#define SDH_BUFFER_WR_EN_MSK          (((1U << SDH_BUFFER_WR_EN_LEN) - 1) << SDH_BUFFER_WR_EN_POS)
#define SDH_BUFFER_WR_EN_UMSK         (~(((1U << SDH_BUFFER_WR_EN_LEN) - 1) << SDH_BUFFER_WR_EN_POS))
#define SDH_BUFFER_RD_EN              SDH_BUFFER_RD_EN
#define SDH_BUFFER_RD_EN_POS          (11U)
#define SDH_BUFFER_RD_EN_LEN          (1U)
#define SDH_BUFFER_RD_EN_MSK          (((1U << SDH_BUFFER_RD_EN_LEN) - 1) << SDH_BUFFER_RD_EN_POS)
#define SDH_BUFFER_RD_EN_UMSK         (~(((1U << SDH_BUFFER_RD_EN_LEN) - 1) << SDH_BUFFER_RD_EN_POS))

