XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
/* 0x26 : Present State Register 2 */
#define SDH_SD_PRESENT_STATE_2_OFFSET (0x26)
#define SDH_CARD_INSERTED             SDH_CARD_INSERTED
#define SDH_CARD_INSERTED_POS         (0U)
#define SDH_CARD_INSERTED_LEN         (1U)
#define SDH_CARD_INSERTED_MSK         (((1U << SDH_CARD_INSERTED_LEN) - 1) << SDH_CARD_INSERTED_POS)
#define SDH_CARD_INSERTED_UMSK        (~(((1U << SDH_CARD_INSERTED_LEN) - 1) << SDH_CARD_INSERTED_POS))
#define SDH_CARD_STABLE               SDH_CARD_STABLE
#define SDH_CARD_STABLE_POS           (1U)
#define SDH_CARD_STABLE_LEN           (1U)
#define SDH_CARD_STABLE_MSK           (((1U << SDH_CARD_STABLE_LEN) - 1) << SDH_CARD_STABLE_POS)
#define SDH_CARD_STABLE_UMSK          (~(((1U << SDH_CARD_STABLE_LEN) - 1) << SDH_CARD_STABLE_POS))
#define SDH_CARD_DET                  SDH_CARD_DET
#define SDH_CARD_DET_POS              (2U)
#define SDH_CARD_DET_LEN              (1U)
#define SDH_CARD_DET_MSK              (((1U << SDH_CARD_DET_LEN) - 1) << SDH_CARD_DET_POS)
#define SDH_CARD_DET_UMSK             (~(((1U << SDH_CARD_DET_LEN) - 1) << SDH_CARD_DET_POS))
#define SDH_WRITE_PROT                SDH_WRITE_PROT
#define SDH_WRITE_PROT_POS            (3U)
#define SDH_WRITE_PROT_LEN            (1U)
#define SDH_WRITE_PROT_MSK            (((1U << SDH_WRITE_PROT_LEN) - 1) << SDH_WRITE_PROT_POS)
#define SDH_WRITE_PROT_UMSK           (~(((1U << SDH_WRITE_PROT_LEN) - 1) << SDH_WRITE_PROT_POS))
#define SDH_DAT_LEVEL                 SDH_DAT_LEVEL
#define SDH_DAT_LEVEL_POS             (4U)
#define SDH_DAT_LEVEL_LEN             (4U)
#define SDH_DAT_LEVEL_MSK             (((1U << SDH_DAT_LEVEL_LEN) - 1) << SDH_DAT_LEVEL_POS)
#define SDH_DAT_LEVEL_UMSK            (~(((1U << SDH_DAT_LEVEL_LEN) - 1) << SDH_DAT_LEVEL_POS))
#define SDH_CMD_LEVEL                 SDH_CMD_LEVEL
#define SDH_CMD_LEVEL_POS             (8U)
#define SDH_CMD_LEVEL_LEN             (1U)
#define SDH_CMD_LEVEL_MSK             (((1U << SDH_CMD_LEVEL_LEN) - 1) << SDH_CMD_LEVEL_POS)
#define SDH_CMD_LEVEL_UMSK            (~(((1U << SDH_CMD_LEVEL_LEN) - 1) << SDH_CMD_LEVEL_POS))

/* 0x28 : Host Control Register */
#define SDH_SD_HOST_CTRL_OFFSET (0x28)
#define SDH_LED_CTRL            SDH_LED_CTRL
#define SDH_LED_CTRL_POS        (0U)
#define SDH_LED_CTRL_LEN        (1U)
#define SDH_LED_CTRL_MSK        (((1U << SDH_LED_CTRL_LEN) - 1) << SDH_LED_CTRL_POS)
#define SDH_LED_CTRL_UMSK       (~(((1U << SDH_LED_CTRL_LEN) - 1) << SDH_LED_CTRL_POS))
#define SDH_DATA_WIDTH          SDH_DATA_WIDTH
#define SDH_DATA_WIDTH_POS      (1U)
#define SDH_DATA_WIDTH_LEN      (1U)
#define SDH_DATA_WIDTH_MSK      (((1U << SDH_DATA_WIDTH_LEN) - 1) << SDH_DATA_WIDTH_POS)
#define SDH_DATA_WIDTH_UMSK     (~(((1U << SDH_DATA_WIDTH_LEN) - 1) << SDH_DATA_WIDTH_POS))
#define SDH_HI_SPEED_EN         SDH_HI_SPEED_EN
#define SDH_HI_SPEED_EN_POS     (2U)
#define SDH_HI_SPEED_EN_LEN     (1U)
#define SDH_HI_SPEED_EN_MSK     (((1U << SDH_HI_SPEED_EN_LEN) - 1) << SDH_HI_SPEED_EN_POS)
#define SDH_HI_SPEED_EN_UMSK    (~(((1U << SDH_HI_SPEED_EN_LEN) - 1) << SDH_HI_SPEED_EN_POS))
#define SDH_DMA_SEL             SDH_DMA_SEL
#define SDH_DMA_SEL_POS         (3U)
#define SDH_DMA_SEL_LEN         (2U)
#define SDH_DMA_SEL_MSK         (((1U << SDH_DMA_SEL_LEN) - 1) << SDH_DMA_SEL_POS)
#define SDH_DMA_SEL_UMSK        (~(((1U << SDH_DMA_SEL_LEN) - 1) << SDH_DMA_SEL_POS))
#define SDH_EX_DATA_WIDTH       SDH_EX_DATA_WIDTH
#define SDH_EX_DATA_WIDTH_POS   (5U)
#define SDH_EX_DATA_WIDTH_LEN   (1U)
#define SDH_EX_DATA_WIDTH_MSK   (((1U << SDH_EX_DATA_WIDTH_LEN) - 1) << SDH_EX_DATA_WIDTH_POS)
#define SDH_EX_DATA_WIDTH_UMSK  (~(((1U << SDH_EX_DATA_WIDTH_LEN) - 1) << SDH_EX_DATA_WIDTH_POS))
#define SDH_CARD_DET_L          SDH_CARD_DET_L
#define SDH_CARD_DET_L_POS      (6U)
#define SDH_CARD_DET_L_LEN      (1U)
#define SDH_CARD_DET_L_MSK      (((1U << SDH_CARD_DET_L_LEN) - 1) << SDH_CARD_DET_L_POS)
#define SDH_CARD_DET_L_UMSK     (~(((1U << SDH_CARD_DET_L_LEN) - 1) << SDH_CARD_DET_L_POS))
#define SDH_CARD_DET_S          SDH_CARD_DET_S
#define SDH_CARD_DET_S_POS      (7U)
#define SDH_CARD_DET_S_LEN      (1U)
#define SDH_CARD_DET_S_MSK      (((1U << SDH_CARD_DET_S_LEN) - 1) << SDH_CARD_DET_S_POS)
#define SDH_CARD_DET_S_UMSK     (~(((1U << SDH_CARD_DET_S_LEN) - 1) << SDH_CARD_DET_S_POS))
#define SDH_SD_BUS_POWER        SDH_SD_BUS_POWER
#define SDH_SD_BUS_POWER_POS    (8U)
#define SDH_SD_BUS_POWER_LEN    (1U)
#define SDH_SD_BUS_POWER_MSK    (((1U << SDH_SD_BUS_POWER_LEN) - 1) << SDH_SD_BUS_POWER_POS)
#define SDH_SD_BUS_POWER_UMSK   (~(((1U << SDH_SD_BUS_POWER_LEN) - 1) << SDH_SD_BUS_POWER_POS))
#define SDH_SD_BUS_VLT          SDH_SD_BUS_VLT
#define SDH_SD_BUS_VLT_POS      (9U)
#define SDH_SD_BUS_VLT_LEN      (3U)
#define SDH_SD_BUS_VLT_MSK      (((1U << SDH_SD_BUS_VLT_LEN) - 1) << SDH_SD_BUS_VLT_POS)
#define SDH_SD_BUS_VLT_UMSK     (~(((1U << SDH_SD_BUS_VLT_LEN) - 1) << SDH_SD_BUS_VLT_POS))

/* 0x2A : Block Gap Control Register */
#define SDH_SD_BLOCK_GAP_CTRL_OFFSET   (0x2A)
#define SDH_STOP_AT_BLOCK_GAP_REQ      SDH_STOP_AT_BLOCK_GAP_REQ
#define SDH_STOP_AT_BLOCK_GAP_REQ_POS  (0U)
#define SDH_STOP_AT_BLOCK_GAP_REQ_LEN  (1U)
#define SDH_STOP_AT_BLOCK_GAP_REQ_MSK  (((1U << SDH_STOP_AT_BLOCK_GAP_REQ_LEN) - 1) << SDH_STOP_AT_BLOCK_GAP_REQ_POS)
#define SDH_STOP_AT_BLOCK_GAP_REQ_UMSK (~(((1U << SDH_STOP_AT_BLOCK_GAP_REQ_LEN) - 1) << SDH_STOP_AT_BLOCK_GAP_REQ_POS))
#define SDH_CONT_REQ                   SDH_CONT_REQ
#define SDH_CONT_REQ_POS               (1U)
#define SDH_CONT_REQ_LEN               (1U)
#define SDH_CONT_REQ_MSK               (((1U << SDH_CONT_REQ_LEN) - 1) << SDH_CONT_REQ_POS)
#define SDH_CONT_REQ_UMSK              (~(((1U << SDH_CONT_REQ_LEN) - 1) << SDH_CONT_REQ_POS))
#define SDH_RD_WAIT_CTL                SDH_RD_WAIT_CTL
#define SDH_RD_WAIT_CTL_POS            (2U)
#define SDH_RD_WAIT_CTL_LEN            (1U)
#define SDH_RD_WAIT_CTL_MSK            (((1U << SDH_RD_WAIT_CTL_LEN) - 1) << SDH_RD_WAIT_CTL_POS)
#define SDH_RD_WAIT_CTL_UMSK           (~(((1U << SDH_RD_WAIT_CTL_LEN) - 1) << SDH_RD_WAIT_CTL_POS))
#define SDH_INT_BLK_GAP                SDH_INT_BLK_GAP
#define SDH_INT_BLK_GAP_POS            (3U)
#define SDH_INT_BLK_GAP_LEN            (1U)
#define SDH_INT_BLK_GAP_MSK            (((1U << SDH_INT_BLK_GAP_LEN) - 1) << SDH_INT_BLK_GAP_POS)
#define SDH_INT_BLK_GAP_UMSK           (~(((1U << SDH_INT_BLK_GAP_LEN) - 1) << SDH_INT_BLK_GAP_POS))
#define SDH_W_CARD_INT                 SDH_W_CARD_INT
#define SDH_W_CARD_INT_POS             (8U)
#define SDH_W_CARD_INT_LEN             (1U)
#define SDH_W_CARD_INT_MSK             (((1U << SDH_W_CARD_INT_LEN) - 1) << SDH_W_CARD_INT_POS)
#define SDH_W_CARD_INT_UMSK            (~(((1U << SDH_W_CARD_INT_LEN) - 1) << SDH_W_CARD_INT_POS))
#define SDH_W_INSERTION                SDH_W_INSERTION
#define SDH_W_INSERTION_POS            (9U)
#define SDH_W_INSERTION_LEN            (1U)
#define SDH_W_INSERTION_MSK            (((1U << SDH_W_INSERTION_LEN) - 1) << SDH_W_INSERTION_POS)
#define SDH_W_INSERTION_UMSK           (~(((1U << SDH_W_INSERTION_LEN) - 1) << SDH_W_INSERTION_POS))
#define SDH_W_REMOVAL                  SDH_W_REMOVAL
#define SDH_W_REMOVAL_POS              (10U)
#define SDH_W_REMOVAL_LEN              (1U)
#define SDH_W_REMOVAL_MSK              (((1U << SDH_W_REMOVAL_LEN) - 1) << SDH_W_REMOVAL_POS)
#define SDH_W_REMOVAL_UMSK             (~(((1U << SDH_W_REMOVAL_LEN) - 1) << SDH_W_REMOVAL_POS))

/* 0x2C : Clock Control Register */
#define SDH_SD_CLOCK_CTRL_OFFSET (0x2C)
#define SDH_INT_CLK_EN           SDH_INT_CLK_EN
#define SDH_INT_CLK_EN_POS       (0U)
#define SDH_INT_CLK_EN_LEN       (1U)
#define SDH_INT_CLK_EN_MSK       (((1U << SDH_INT_CLK_EN_LEN) - 1) << SDH_INT_CLK_EN_POS)
#define SDH_INT_CLK_EN_UMSK      (~(((1U << SDH_INT_CLK_EN_LEN) - 1) << SDH_INT_CLK_EN_POS))
#define SDH_INT_CLK_STABLE       SDH_INT_CLK_STABLE
#define SDH_INT_CLK_STABLE_POS   (1U)
#define SDH_INT_CLK_STABLE_LEN   (1U)
#define SDH_INT_CLK_STABLE_MSK   (((1U << SDH_INT_CLK_STABLE_LEN) - 1) << SDH_INT_CLK_STABLE_POS)
#define SDH_INT_CLK_STABLE_UMSK  (~(((1U << SDH_INT_CLK_STABLE_LEN) - 1) << SDH_INT_CLK_STABLE_POS))
#define SDH_SD_CLK_EN            SDH_SD_CLK_EN
#define SDH_SD_CLK_EN_POS        (2U)
#define SDH_SD_CLK_EN_LEN        (1U)
#define SDH_SD_CLK_EN_MSK        (((1U << SDH_SD_CLK_EN_LEN) - 1) << SDH_SD_CLK_EN_POS)
#define SDH_SD_CLK_EN_UMSK       (~(((1U << SDH_SD_CLK_EN_LEN) - 1) << SDH_SD_CLK_EN_POS))
#define SDH_CLK_GEN_SEL          SDH_CLK_GEN_SEL
#define SDH_CLK_GEN_SEL_POS      (5U)
#define SDH_CLK_GEN_SEL_LEN      (1U)
#define SDH_CLK_GEN_SEL_MSK      (((1U << SDH_CLK_GEN_SEL_LEN) - 1) << SDH_CLK_GEN_SEL_POS)
#define SDH_CLK_GEN_SEL_UMSK     (~(((1U << SDH_CLK_GEN_SEL_LEN) - 1) << SDH_CLK_GEN_SEL_POS))
#define SDH_SD_FREQ_SEL_HI       SDH_SD_FREQ_SEL_HI
#define SDH_SD_FREQ_SEL_HI_POS   (6U)
#define SDH_SD_FREQ_SEL_HI_LEN   (2U)
#define SDH_SD_FREQ_SEL_HI_MSK   (((1U << SDH_SD_FREQ_SEL_HI_LEN) - 1) << SDH_SD_FREQ_SEL_HI_POS)
#define SDH_SD_FREQ_SEL_HI_UMSK  (~(((1U << SDH_SD_FREQ_SEL_HI_LEN) - 1) << SDH_SD_FREQ_SEL_HI_POS))
#define SDH_SD_FREQ_SEL_LO       SDH_SD_FREQ_SEL_LO
#define SDH_SD_FREQ_SEL_LO_POS   (8U)
#define SDH_SD_FREQ_SEL_LO_LEN   (8U)
#define SDH_SD_FREQ_SEL_LO_MSK   (((1U << SDH_SD_FREQ_SEL_LO_LEN) - 1) << SDH_SD_FREQ_SEL_LO_POS)
#define SDH_SD_FREQ_SEL_LO_UMSK  (~(((1U << SDH_SD_FREQ_SEL_LO_LEN) - 1) << SDH_SD_FREQ_SEL_LO_POS))

/* 0x2E : Timeout Control/Software Reset Register */
#define SDH_SD_TIMEOUT_CTRL_SW_RESET_OFFSET (0x2E)
#define SDH_TIMEOUT_VALUE                   SDH_TIMEOUT_VALUE
#define SDH_TIMEOUT_VALUE_POS               (0U)
#define SDH_TIMEOUT_VALUE_LEN               (4U)
#define SDH_TIMEOUT_VALUE_MSK               (((1U << SDH_TIMEOUT_VALUE_LEN) - 1) << SDH_TIMEOUT_VALUE_POS)
#define SDH_TIMEOUT_VALUE_UMSK              (~(((1U << SDH_TIMEOUT_VALUE_LEN) - 1) << SDH_TIMEOUT_VALUE_POS))
#define SDH_SW_RST_ALL                      SDH_SW_RST_ALL
#define SDH_SW_RST_ALL_POS                  (8U)
#define SDH_SW_RST_ALL_LEN                  (1U)
#define SDH_SW_RST_ALL_MSK                  (((1U << SDH_SW_RST_ALL_LEN) - 1) << SDH_SW_RST_ALL_POS)
#define SDH_SW_RST_ALL_UMSK                 (~(((1U << SDH_SW_RST_ALL_LEN) - 1) << SDH_SW_RST_ALL_POS))
#define SDH_SW_RST_CMD                      SDH_SW_RST_CMD
#define SDH_SW_RST_CMD_POS                  (9U)
#define SDH_SW_RST_CMD_LEN                  (1U)
#define SDH_SW_RST_CMD_MSK                  (((1U << SDH_SW_RST_CMD_LEN) - 1) << SDH_SW_RST_CMD_POS)
#define SDH_SW_RST_CMD_UMSK                 (~(((1U << SDH_SW_RST_CMD_LEN) - 1) << SDH_SW_RST_CMD_POS))
#define SDH_SW_RST_DAT                      SDH_SW_RST_DAT
#define SDH_SW_RST_DAT_POS                  (10U)
#define SDH_SW_RST_DAT_LEN                  (1U)
#define SDH_SW_RST_DAT_MSK                  (((1U << SDH_SW_RST_DAT_LEN) - 1) << SDH_SW_RST_DAT_POS)
#define SDH_SW_RST_DAT_UMSK                 (~(((1U << SDH_SW_RST_DAT_LEN) - 1) << SDH_SW_RST_DAT_POS))

/* 0x30 : Normal Interrupt Status Register */
#define SDH_SD_NORMAL_INT_STATUS_OFFSET (0x30)
#define SDH_CMD_COMPLETE                SDH_CMD_COMPLETE
#define SDH_CMD_COMPLETE_POS            (0U)
#define SDH_CMD_COMPLETE_LEN            (1U)
#define SDH_CMD_COMPLETE_MSK            (((1U << SDH_CMD_COMPLETE_LEN) - 1) << SDH_CMD_COMPLETE_POS)
#define SDH_CMD_COMPLETE_UMSK           (~(((1U << SDH_CMD_COMPLETE_LEN) - 1) << SDH_CMD_COMPLETE_POS))
#define SDH_XFER_COMPLETE               SDH_XFER_COMPLETE
#define SDH_XFER_COMPLETE_POS           (1U)
#define SDH_XFER_COMPLETE_LEN           (1U)
#define SDH_XFER_COMPLETE_MSK           (((1U << SDH_XFER_COMPLETE_LEN) - 1) << SDH_XFER_COMPLETE_POS)
#define SDH_XFER_COMPLETE_UMSK          (~(((1U << SDH_XFER_COMPLETE_LEN) - 1) << SDH_XFER_COMPLETE_POS))
#define SDH_BLOCK_GAP_EVT               SDH_BLOCK_GAP_EVT
#define SDH_BLOCK_GAP_EVT_POS           (2U)
#define SDH_BLOCK_GAP_EVT_LEN           (1U)
#define SDH_BLOCK_GAP_EVT_MSK           (((1U << SDH_BLOCK_GAP_EVT_LEN) - 1) << SDH_BLOCK_GAP_EVT_POS)
#define SDH_BLOCK_GAP_EVT_UMSK          (~(((1U << SDH_BLOCK_GAP_EVT_LEN) - 1) << SDH_BLOCK_GAP_EVT_POS))
#define SDH_DMA_INT                     SDH_DMA_INT
#define SDH_DMA_INT_POS                 (3U)
#define SDH_DMA_INT_LEN                 (1U)
#define SDH_DMA_INT_MSK                 (((1U << SDH_DMA_INT_LEN) - 1) << SDH_DMA_INT_POS)
#define SDH_DMA_INT_UMSK                (~(((1U << SDH_DMA_INT_LEN) - 1) << SDH_DMA_INT_POS))
#define SDH_TX_RDY                      SDH_TX_RDY
#define SDH_TX_RDY_POS                  (4U)
#define SDH_TX_RDY_LEN                  (1U)
#define SDH_TX_RDY_MSK                  (((1U << SDH_TX_RDY_LEN) - 1) << SDH_TX_RDY_POS)
#define SDH_TX_RDY_UMSK                 (~(((1U << SDH_TX_RDY_LEN) - 1) << SDH_TX_RDY_POS))
#define SDH_RX_RDY                      SDH_RX_RDY
#define SDH_RX_RDY_POS                  (5U)
#define SDH_RX_RDY_LEN                  (1U)
#define SDH_RX_RDY_MSK                  (((1U << SDH_RX_RDY_LEN) - 1) << SDH_RX_RDY_POS)
#define SDH_RX_RDY_UMSK                 (~(((1U << SDH_RX_RDY_LEN) - 1) << SDH_RX_RDY_POS))
#define SDH_CARD_INS_INT                SDH_CARD_INS_INT
#define SDH_CARD_INS_INT_POS            (6U)
#define SDH_CARD_INS_INT_LEN            (1U)
#define SDH_CARD_INS_INT_MSK            (((1U << SDH_CARD_INS_INT_LEN) - 1) << SDH_CARD_INS_INT_POS)
#define SDH_CARD_INS_INT_UMSK           (~(((1U << SDH_CARD_INS_INT_LEN) - 1) << SDH_CARD_INS_INT_POS))
#define SDH_CARD_REM_INT                SDH_CARD_REM_INT
#define SDH_CARD_REM_INT_POS            (7U)
#define SDH_CARD_REM_INT_LEN            (1U)
#define SDH_CARD_REM_INT_MSK            (((1U << SDH_CARD_REM_INT_LEN) - 1) << SDH_CARD_REM_INT_POS)
#define SDH_CARD_REM_INT_UMSK           (~(((1U << SDH_CARD_REM_INT_LEN) - 1) << SDH_CARD_REM_INT_POS))
#define SDH_CARD_INT                    SDH_CARD_INT
#define SDH_CARD_INT_POS                (8U)
#define SDH_CARD_INT_LEN                (1U)
#define SDH_CARD_INT_MSK                (((1U << SDH_CARD_INT_LEN) - 1) << SDH_CARD_INT_POS)
#define SDH_CARD_INT_UMSK               (~(((1U << SDH_CARD_INT_LEN) - 1) << SDH_CARD_INT_POS))
#define SDH_INT_A                       SDH_INT_A
#define SDH_INT_A_POS                   (9U)
#define SDH_INT_A_LEN                   (1U)
#define SDH_INT_A_MSK                   (((1U << SDH_INT_A_LEN) - 1) << SDH_INT_A_POS)
#define SDH_INT_A_UMSK                  (~(((1U << SDH_INT_A_LEN) - 1) << SDH_INT_A_POS))
#define SDH_INT_B                       SDH_INT_B
#define SDH_INT_B_POS                   (10U)
#define SDH_INT_B_LEN                   (1U)
#define SDH_INT_B_MSK                   (((1U << SDH_INT_B_LEN) - 1) << SDH_INT_B_POS)
#define SDH_INT_B_UMSK                  (~(((1U << SDH_INT_B_LEN) - 1) << SDH_INT_B_POS))
#define SDH_INT_C                       SDH_INT_C
#define SDH_INT_C_POS                   (11U)
#define SDH_INT_C_LEN                   (1U)
#define SDH_INT_C_MSK                   (((1U << SDH_INT_C_LEN) - 1) << SDH_INT_C_POS)
#define SDH_INT_C_UMSK                  (~(((1U << SDH_INT_C_LEN) - 1) << SDH_INT_C_POS))
#define SDH_RETUNING_INT                SDH_RETUNING_INT
#define SDH_RETUNING_INT_POS            (12U)
#define SDH_RETUNING_INT_LEN            (1U)
#define SDH_RETUNING_INT_MSK            (((1U << SDH_RETUNING_INT_LEN) - 1) << SDH_RETUNING_INT_POS)
#define SDH_RETUNING_INT_UMSK           (~(((1U << SDH_RETUNING_INT_LEN) - 1) << SDH_RETUNING_INT_POS))
#define SDH_ERR_INT                     SDH_ERR_INT
#define SDH_ERR_INT_POS                 (15U)
#define SDH_ERR_INT_LEN                 (1U)
#define SDH_ERR_INT_MSK                 (((1U << SDH_ERR_INT_LEN) - 1) << SDH_ERR_INT_POS)
#define SDH_ERR_INT_UMSK                (~(((1U << SDH_ERR_INT_LEN) - 1) << SDH_ERR_INT_POS))

/* 0x32 : Error Interrupt Status Register */
#define SDH_SD_ERROR_INT_STATUS_OFFSET (0x32)
#define SDH_CMD_TIMEOUT_ERR            SDH_CMD_TIMEOUT_ERR
#define SDH_CMD_TIMEOUT_ERR_POS        (0U)
#define SDH_CMD_TIMEOUT_ERR_LEN        (1U)
#define SDH_CMD_TIMEOUT_ERR_MSK        (((1U << SDH_CMD_TIMEOUT_ERR_LEN) - 1) << SDH_CMD_TIMEOUT_ERR_POS)
#define SDH_CMD_TIMEOUT_ERR_UMSK       (~(((1U << SDH_CMD_TIMEOUT_ERR_LEN) - 1) << SDH_CMD_TIMEOUT_ERR_POS))
#define SDH_CMD_CRC_ERR                SDH_CMD_CRC_ERR
#define SDH_CMD_CRC_ERR_POS            (1U)
#define SDH_CMD_CRC_ERR_LEN            (1U)
#define SDH_CMD_CRC_ERR_MSK            (((1U << SDH_CMD_CRC_ERR_LEN) - 1) << SDH_CMD_CRC_ERR_POS)
#define SDH_CMD_CRC_ERR_UMSK           (~(((1U << SDH_CMD_CRC_ERR_LEN) - 1) << SDH_CMD_CRC_ERR_POS))
#define SDH_CMD_END_BIT_ERR            SDH_CMD_END_BIT_ERR
#define SDH_CMD_END_BIT_ERR_POS        (2U)
#define SDH_CMD_END_BIT_ERR_LEN        (1U)
#define SDH_CMD_END_BIT_ERR_MSK        (((1U << SDH_CMD_END_BIT_ERR_LEN) - 1) << SDH_CMD_END_BIT_ERR_POS)
#define SDH_CMD_END_BIT_ERR_UMSK       (~(((1U << SDH_CMD_END_BIT_ERR_LEN) - 1) << SDH_CMD_END_BIT_ERR_POS))
#define SDH_CMD_INDEX_ERR              SDH_CMD_INDEX_ERR
#define SDH_CMD_INDEX_ERR_POS          (3U)
#define SDH_CMD_INDEX_ERR_LEN          (1U)
#define SDH_CMD_INDEX_ERR_MSK          (((1U << SDH_CMD_INDEX_ERR_LEN) - 1) << SDH_CMD_INDEX_ERR_POS)
#define SDH_CMD_INDEX_ERR_UMSK         (~(((1U << SDH_CMD_INDEX_ERR_LEN) - 1) << SDH_CMD_INDEX_ERR_POS))
#define SDH_DATA_TIMEOUT_ERR           SDH_DATA_TIMEOUT_ERR
#define SDH_DATA_TIMEOUT_ERR_POS       (4U)
#define SDH_DATA_TIMEOUT_ERR_LEN       (1U)
#define SDH_DATA_TIMEOUT_ERR_MSK       (((1U << SDH_DATA_TIMEOUT_ERR_LEN) - 1) << SDH_DATA_TIMEOUT_ERR_POS)
#define SDH_DATA_TIMEOUT_ERR_UMSK      (~(((1U << SDH_DATA_TIMEOUT_ERR_LEN) - 1) << SDH_DATA_TIMEOUT_ERR_POS))
#define SDH_RD_DATA_CRC_ERR            SDH_RD_DATA_CRC_ERR
#define SDH_RD_DATA_CRC_ERR_POS        (5U)
#define SDH_RD_DATA_CRC_ERR_LEN        (1U)
#define SDH_RD_DATA_CRC_ERR_MSK        (((1U << SDH_RD_DATA_CRC_ERR_LEN) - 1) << SDH_RD_DATA_CRC_ERR_POS)
#define SDH_RD_DATA_CRC_ERR_UMSK       (~(((1U << SDH_RD_DATA_CRC_ERR_LEN) - 1) << SDH_RD_DATA_CRC_ERR_POS))
#define SDH_RD_DATA_END_BIT_ERR        SDH_RD_DATA_END_BIT_ERR
#define SDH_RD_DATA_END_BIT_ERR_POS    (6U)
#define SDH_RD_DATA_END_BIT_ERR_LEN    (1U)
#define SDH_RD_DATA_END_BIT_ERR_MSK    (((1U << SDH_RD_DATA_END_BIT_ERR_LEN) - 1) << SDH_RD_DATA_END_BIT_ERR_POS)
#define SDH_RD_DATA_END_BIT_ERR_UMSK   (~(((1U << SDH_RD_DATA_END_BIT_ERR_LEN) - 1) << SDH_RD_DATA_END_BIT_ERR_POS))
#define SDH_CUR_LIMIT_ERR              SDH_CUR_LIMIT_ERR
#define SDH_CUR_LIMIT_ERR_POS          (7U)
#define SDH_CUR_LIMIT_ERR_LEN          (1U)
#define SDH_CUR_LIMIT_ERR_MSK          (((1U << SDH_CUR_LIMIT_ERR_LEN) - 1) << SDH_CUR_LIMIT_ERR_POS)
#define SDH_CUR_LIMIT_ERR_UMSK         (~(((1U << SDH_CUR_LIMIT_ERR_LEN) - 1) << SDH_CUR_LIMIT_ERR_POS))
#define SDH_AUTO_CMD12_ERR             SDH_AUTO_CMD12_ERR
#define SDH_AUTO_CMD12_ERR_POS         (8U)
#define SDH_AUTO_CMD12_ERR_LEN         (1U)
#define SDH_AUTO_CMD12_ERR_MSK         (((1U << SDH_AUTO_CMD12_ERR_LEN) - 1) << SDH_AUTO_CMD12_ERR_POS)
#define SDH_AUTO_CMD12_ERR_UMSK        (~(((1U << SDH_AUTO_CMD12_ERR_LEN) - 1) << SDH_AUTO_CMD12_ERR_POS))
#define SDH_ADMA_ERR                   SDH_ADMA_ERR
#define SDH_ADMA_ERR_POS               (9U)
#define SDH_ADMA_ERR_LEN               (1U)
#define SDH_ADMA_ERR_MSK               (((1U << SDH_ADMA_ERR_LEN) - 1) << SDH_ADMA_ERR_POS)
#define SDH_ADMA_ERR_UMSK              (~(((1U << SDH_ADMA_ERR_LEN) - 1) << SDH_ADMA_ERR_POS))
#define SDH_TUNE_ERR                   SDH_TUNE_ERR
#define SDH_TUNE_ERR_POS               (10U)
#define SDH_TUNE_ERR_LEN               (1U)
#define SDH_TUNE_ERR_MSK               (((1U << SDH_TUNE_ERR_LEN) - 1) << SDH_TUNE_ERR_POS)
#define SDH_TUNE_ERR_UMSK              (~(((1U << SDH_TUNE_ERR_LEN) - 1) << SDH_TUNE_ERR_POS))
#define SDH_SPI_ERR                    SDH_SPI_ERR
#define SDH_SPI_ERR_POS                (12U)
#define SDH_SPI_ERR_LEN                (1U)
#define SDH_SPI_ERR_MSK                (((1U << SDH_SPI_ERR_LEN) - 1) << SDH_SPI_ERR_POS)
#define SDH_SPI_ERR_UMSK               (~(((1U << SDH_SPI_ERR_LEN) - 1) << SDH_SPI_ERR_POS))
#define SDH_AXI_RESP_ERR               SDH_AXI_RESP_ERR
#define SDH_AXI_RESP_ERR_POS           (13U)
#define SDH_AXI_RESP_ERR_LEN           (1U)
#define SDH_AXI_RESP_ERR_MSK           (((1U << SDH_AXI_RESP_ERR_LEN) - 1) << SDH_AXI_RESP_ERR_POS)
#define SDH_AXI_RESP_ERR_UMSK          (~(((1U << SDH_AXI_RESP_ERR_LEN) - 1) << SDH_AXI_RESP_ERR_POS))
#define SDH_CPL_TIMEOUT_ERR            SDH_CPL_TIMEOUT_ERR
#define SDH_CPL_TIMEOUT_ERR_POS        (14U)
#define SDH_CPL_TIMEOUT_ERR_LEN        (1U)
#define SDH_CPL_TIMEOUT_ERR_MSK        (((1U << SDH_CPL_TIMEOUT_ERR_LEN) - 1) << SDH_CPL_TIMEOUT_ERR_POS)
#define SDH_CPL_TIMEOUT_ERR_UMSK       (~(((1U << SDH_CPL_TIMEOUT_ERR_LEN) - 1) << SDH_CPL_TIMEOUT_ERR_POS))
#define SDH_CRC_STATUS_ERR             SDH_CRC_STATUS_ERR
#define SDH_CRC_STATUS_ERR_POS         (15U)
#define SDH_CRC_STATUS_ERR_LEN         (1U)
#define SDH_CRC_STATUS_ERR_MSK         (((1U << SDH_CRC_STATUS_ERR_LEN) - 1) << SDH_CRC_STATUS_ERR_POS)
#define SDH_CRC_STATUS_ERR_UMSK        (~(((1U << SDH_CRC_STATUS_ERR_LEN) - 1) << SDH_CRC_STATUS_ERR_POS))

