XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
/* 0x38 : Normal Interrupt Status Interrupt Enable Register */
#define SDH_SD_NORMAL_INT_STATUS_INT_EN_OFFSET (0x38)
#define SDH_CMD_COMPLETE_INT_EN                SDH_CMD_COMPLETE_INT_EN
#define SDH_CMD_COMPLETE_INT_EN_POS            (0U)
#define SDH_CMD_COMPLETE_INT_EN_LEN            (1U)
#define SDH_CMD_COMPLETE_INT_EN_MSK            (((1U << SDH_CMD_COMPLETE_INT_EN_LEN) - 1) << SDH_CMD_COMPLETE_INT_EN_POS)
#define SDH_CMD_COMPLETE_INT_EN_UMSK           (~(((1U << SDH_CMD_COMPLETE_INT_EN_LEN) - 1) << SDH_CMD_COMPLETE_INT_EN_POS))
#define SDH_XFER_COMPLETE_INT_EN               SDH_XFER_COMPLETE_INT_EN
#define SDH_XFER_COMPLETE_INT_EN_POS           (1U)
#define SDH_XFER_COMPLETE_INT_EN_LEN           (1U)
#define SDH_XFER_COMPLETE_INT_EN_MSK           (((1U << SDH_XFER_COMPLETE_INT_EN_LEN) - 1) << SDH_XFER_COMPLETE_INT_EN_POS)
#define SDH_XFER_COMPLETE_INT_EN_UMSK          (~(((1U << SDH_XFER_COMPLETE_INT_EN_LEN) - 1) << SDH_XFER_COMPLETE_INT_EN_POS))
#define SDH_BLOCK_GAP_EVT_INT_EN               SDH_BLOCK_GAP_EVT_INT_EN
#define SDH_BLOCK_GAP_EVT_INT_EN_POS           (2U)
#define SDH_BLOCK_GAP_EVT_INT_EN_LEN           (1U)
#define SDH_BLOCK_GAP_EVT_INT_EN_MSK           (((1U << SDH_BLOCK_GAP_EVT_INT_EN_LEN) - 1) << SDH_BLOCK_GAP_EVT_INT_EN_POS)
#define SDH_BLOCK_GAP_EVT_INT_EN_UMSK          (~(((1U << SDH_BLOCK_GAP_EVT_INT_EN_LEN) - 1) << SDH_BLOCK_GAP_EVT_INT_EN_POS))
#define SDH_DMA_INT_INT_EN                     SDH_DMA_INT_INT_EN
#define SDH_DMA_INT_INT_EN_POS                 (3U)
#define SDH_DMA_INT_INT_EN_LEN                 (1U)
#define SDH_DMA_INT_INT_EN_MSK                 (((1U << SDH_DMA_INT_INT_EN_LEN) - 1) << SDH_DMA_INT_INT_EN_POS)
#define SDH_DMA_INT_INT_EN_UMSK                (~(((1U << SDH_DMA_INT_INT_EN_LEN) - 1) << SDH_DMA_INT_INT_EN_POS))
#define SDH_TX_RDY_INT_EN                      SDH_TX_RDY_INT_EN
#define SDH_TX_RDY_INT_EN_POS                  (4U)
#define SDH_TX_RDY_INT_EN_LEN                  (1U)
#define SDH_TX_RDY_INT_EN_MSK                  (((1U << SDH_TX_RDY_INT_EN_LEN) - 1) << SDH_TX_RDY_INT_EN_POS)
#define SDH_TX_RDY_INT_EN_UMSK                 (~(((1U << SDH_TX_RDY_INT_EN_LEN) - 1) << SDH_TX_RDY_INT_EN_POS))
#define SDH_RX_RDY_INT_EN                      SDH_RX_RDY_INT_EN
#define SDH_RX_RDY_INT_EN_POS                  (5U)
#define SDH_RX_RDY_INT_EN_LEN                  (1U)
#define SDH_RX_RDY_INT_EN_MSK                  (((1U << SDH_RX_RDY_INT_EN_LEN) - 1) << SDH_RX_RDY_INT_EN_POS)
#define SDH_RX_RDY_INT_EN_UMSK                 (~(((1U << SDH_RX_RDY_INT_EN_LEN) - 1) << SDH_RX_RDY_INT_EN_POS))
#define SDH_CARD_INS_INT_EN                    SDH_CARD_INS_INT_EN
#define SDH_CARD_INS_INT_EN_POS                (6U)
#define SDH_CARD_INS_INT_EN_LEN                (1U)
#define SDH_CARD_INS_INT_EN_MSK                (((1U << SDH_CARD_INS_INT_EN_LEN) - 1) << SDH_CARD_INS_INT_EN_POS)
#define SDH_CARD_INS_INT_EN_UMSK               (~(((1U << SDH_CARD_INS_INT_EN_LEN) - 1) << SDH_CARD_INS_INT_EN_POS))
#define SDH_CARD_REM_INT_EN                    SDH_CARD_REM_INT_EN
#define SDH_CARD_REM_INT_EN_POS                (7U)
#define SDH_CARD_REM_INT_EN_LEN                (1U)
#define SDH_CARD_REM_INT_EN_MSK                (((1U << SDH_CARD_REM_INT_EN_LEN) - 1) << SDH_CARD_REM_INT_EN_POS)
#define SDH_CARD_REM_INT_EN_UMSK               (~(((1U << SDH_CARD_REM_INT_EN_LEN) - 1) << SDH_CARD_REM_INT_EN_POS))
#define SDH_CARD_INT_INT_EN                    SDH_CARD_INT_INT_EN
#define SDH_CARD_INT_INT_EN_POS                (8U)
#define SDH_CARD_INT_INT_EN_LEN                (1U)
#define SDH_CARD_INT_INT_EN_MSK                (((1U << SDH_CARD_INT_INT_EN_LEN) - 1) << SDH_CARD_INT_INT_EN_POS)
#define SDH_CARD_INT_INT_EN_UMSK               (~(((1U << SDH_CARD_INT_INT_EN_LEN) - 1) << SDH_CARD_INT_INT_EN_POS))
#define SDH_INT_A_INT_INT_EN                   SDH_INT_A_INT_INT_EN
#define SDH_INT_A_INT_INT_EN_POS               (9U)
#define SDH_INT_A_INT_INT_EN_LEN               (1U)
#define SDH_INT_A_INT_INT_EN_MSK               (((1U << SDH_INT_A_INT_INT_EN_LEN) - 1) << SDH_INT_A_INT_INT_EN_POS)
#define SDH_INT_A_INT_INT_EN_UMSK              (~(((1U << SDH_INT_A_INT_INT_EN_LEN) - 1) << SDH_INT_A_INT_INT_EN_POS))
#define SDH_INT_B_INT_INT_EN                   SDH_INT_B_INT_INT_EN
#define SDH_INT_B_INT_INT_EN_POS               (10U)
#define SDH_INT_B_INT_INT_EN_LEN               (1U)
#define SDH_INT_B_INT_INT_EN_MSK               (((1U << SDH_INT_B_INT_INT_EN_LEN) - 1) << SDH_INT_B_INT_INT_EN_POS)
#define SDH_INT_B_INT_INT_EN_UMSK              (~(((1U << SDH_INT_B_INT_INT_EN_LEN) - 1) << SDH_INT_B_INT_INT_EN_POS))
#define SDH_INT_C_INT_INT_EN                   SDH_INT_C_INT_INT_EN
#define SDH_INT_C_INT_INT_EN_POS               (11U)
#define SDH_INT_C_INT_INT_EN_LEN               (1U)
#define SDH_INT_C_INT_INT_EN_MSK               (((1U << SDH_INT_C_INT_INT_EN_LEN) - 1) << SDH_INT_C_INT_INT_EN_POS)
#define SDH_INT_C_INT_INT_EN_UMSK              (~(((1U << SDH_INT_C_INT_INT_EN_LEN) - 1) << SDH_INT_C_INT_INT_EN_POS))
#define SDH_RETUNE_INT_INT_EN                  SDH_RETUNE_INT_INT_EN
#define SDH_RETUNE_INT_INT_EN_POS              (12U)
#define SDH_RETUNE_INT_INT_EN_LEN              (1U)
#define SDH_RETUNE_INT_INT_EN_MSK              (((1U << SDH_RETUNE_INT_INT_EN_LEN) - 1) << SDH_RETUNE_INT_INT_EN_POS)
#define SDH_RETUNE_INT_INT_EN_UMSK             (~(((1U << SDH_RETUNE_INT_INT_EN_LEN) - 1) << SDH_RETUNE_INT_INT_EN_POS))

/* 0x3A : Error Interrupt Status Interrupt Enable Register */
#define SDH_SD_ERROR_INT_STATUS_INT_EN_OFFSET (0x3A)
#define SDH_CMD_TIMEOUT_ERR_INT_EN            SDH_CMD_TIMEOUT_ERR_INT_EN
#define SDH_CMD_TIMEOUT_ERR_INT_EN_POS        (0U)
#define SDH_CMD_TIMEOUT_ERR_INT_EN_LEN        (1U)
#define SDH_CMD_TIMEOUT_ERR_INT_EN_MSK        (((1U << SDH_CMD_TIMEOUT_ERR_INT_EN_LEN) - 1) << SDH_CMD_TIMEOUT_ERR_INT_EN_POS)
#define SDH_CMD_TIMEOUT_ERR_INT_EN_UMSK       (~(((1U << SDH_CMD_TIMEOUT_ERR_INT_EN_LEN) - 1) << SDH_CMD_TIMEOUT_ERR_INT_EN_POS))
#define SDH_CMD_CRC_ERR_INT_EN                SDH_CMD_CRC_ERR_INT_EN
#define SDH_CMD_CRC_ERR_INT_EN_POS            (1U)
#define SDH_CMD_CRC_ERR_INT_EN_LEN            (1U)
#define SDH_CMD_CRC_ERR_INT_EN_MSK            (((1U << SDH_CMD_CRC_ERR_INT_EN_LEN) - 1) << SDH_CMD_CRC_ERR_INT_EN_POS)
#define SDH_CMD_CRC_ERR_INT_EN_UMSK           (~(((1U << SDH_CMD_CRC_ERR_INT_EN_LEN) - 1) << SDH_CMD_CRC_ERR_INT_EN_POS))
#define SDH_CMD_END_BIT_ERR_INT_EN            SDH_CMD_END_BIT_ERR_INT_EN
#define SDH_CMD_END_BIT_ERR_INT_EN_POS        (2U)
#define SDH_CMD_END_BIT_ERR_INT_EN_LEN        (1U)
#define SDH_CMD_END_BIT_ERR_INT_EN_MSK        (((1U << SDH_CMD_END_BIT_ERR_INT_EN_LEN) - 1) << SDH_CMD_END_BIT_ERR_INT_EN_POS)
#define SDH_CMD_END_BIT_ERR_INT_EN_UMSK       (~(((1U << SDH_CMD_END_BIT_ERR_INT_EN_LEN) - 1) << SDH_CMD_END_BIT_ERR_INT_EN_POS))
#define SDH_CMD_INDEX_ERR_INT_EN              SDH_CMD_INDEX_ERR_INT_EN
#define SDH_CMD_INDEX_ERR_INT_EN_POS          (3U)
#define SDH_CMD_INDEX_ERR_INT_EN_LEN          (1U)
#define SDH_CMD_INDEX_ERR_INT_EN_MSK          (((1U << SDH_CMD_INDEX_ERR_INT_EN_LEN) - 1) << SDH_CMD_INDEX_ERR_INT_EN_POS)
#define SDH_CMD_INDEX_ERR_INT_EN_UMSK         (~(((1U << SDH_CMD_INDEX_ERR_INT_EN_LEN) - 1) << SDH_CMD_INDEX_ERR_INT_EN_POS))
#define SDH_DATA_TIMEOUT_ERR_INT_EN           SDH_DATA_TIMEOUT_ERR_INT_EN
#define SDH_DATA_TIMEOUT_ERR_INT_EN_POS       (4U)
#define SDH_DATA_TIMEOUT_ERR_INT_EN_LEN       (1U)
#define SDH_DATA_TIMEOUT_ERR_INT_EN_MSK       (((1U << SDH_DATA_TIMEOUT_ERR_INT_EN_LEN) - 1) << SDH_DATA_TIMEOUT_ERR_INT_EN_POS)
#define SDH_DATA_TIMEOUT_ERR_INT_EN_UMSK      (~(((1U << SDH_DATA_TIMEOUT_ERR_INT_EN_LEN) - 1) << SDH_DATA_TIMEOUT_ERR_INT_EN_POS))
#define SDH_RD_DATA_CRC_ERR_INT_EN            SDH_RD_DATA_CRC_ERR_INT_EN
#define SDH_RD_DATA_CRC_ERR_INT_EN_POS        (5U)
#define SDH_RD_DATA_CRC_ERR_INT_EN_LEN        (1U)
#define SDH_RD_DATA_CRC_ERR_INT_EN_MSK        (((1U << SDH_RD_DATA_CRC_ERR_INT_EN_LEN) - 1) << SDH_RD_DATA_CRC_ERR_INT_EN_POS)
#define SDH_RD_DATA_CRC_ERR_INT_EN_UMSK       (~(((1U << SDH_RD_DATA_CRC_ERR_INT_EN_LEN) - 1) << SDH_RD_DATA_CRC_ERR_INT_EN_POS))
#define SDH_RD_DATA_END_BIT_ERR_INT_EN        SDH_RD_DATA_END_BIT_ERR_INT_EN
#define SDH_RD_DATA_END_BIT_ERR_INT_EN_POS    (6U)
#define SDH_RD_DATA_END_BIT_ERR_INT_EN_LEN    (1U)
#define SDH_RD_DATA_END_BIT_ERR_INT_EN_MSK    (((1U << SDH_RD_DATA_END_BIT_ERR_INT_EN_LEN) - 1) << SDH_RD_DATA_END_BIT_ERR_INT_EN_POS)
#define SDH_RD_DATA_END_BIT_ERR_INT_EN_UMSK   (~(((1U << SDH_RD_DATA_END_BIT_ERR_INT_EN_LEN) - 1) << SDH_RD_DATA_END_BIT_ERR_INT_EN_POS))
#define SDH_CUR_LIM_ERR_INT_EN                SDH_CUR_LIM_ERR_INT_EN
#define SDH_CUR_LIM_ERR_INT_EN_POS            (7U)
#define SDH_CUR_LIM_ERR_INT_EN_LEN            (1U)
#define SDH_CUR_LIM_ERR_INT_EN_MSK            (((1U << SDH_CUR_LIM_ERR_INT_EN_LEN) - 1) << SDH_CUR_LIM_ERR_INT_EN_POS)
#define SDH_CUR_LIM_ERR_INT_EN_UMSK           (~(((1U << SDH_CUR_LIM_ERR_INT_EN_LEN) - 1) << SDH_CUR_LIM_ERR_INT_EN_POS))
#define SDH_AUTO_CMD12_ERR_INT_EN             SDH_AUTO_CMD12_ERR_INT_EN
#define SDH_AUTO_CMD12_ERR_INT_EN_POS         (8U)
#define SDH_AUTO_CMD12_ERR_INT_EN_LEN         (1U)
#define SDH_AUTO_CMD12_ERR_INT_EN_MSK         (((1U << SDH_AUTO_CMD12_ERR_INT_EN_LEN) - 1) << SDH_AUTO_CMD12_ERR_INT_EN_POS)
#define SDH_AUTO_CMD12_ERR_INT_EN_UMSK        (~(((1U << SDH_AUTO_CMD12_ERR_INT_EN_LEN) - 1) << SDH_AUTO_CMD12_ERR_INT_EN_POS))
#define SDH_ADMA_ERR_INT_EN                   SDH_ADMA_ERR_INT_EN
#define SDH_ADMA_ERR_INT_EN_POS               (9U)
#define SDH_ADMA_ERR_INT_EN_LEN               (1U)
#define SDH_ADMA_ERR_INT_EN_MSK               (((1U << SDH_ADMA_ERR_INT_EN_LEN) - 1) << SDH_ADMA_ERR_INT_EN_POS)
#define SDH_ADMA_ERR_INT_EN_UMSK              (~(((1U << SDH_ADMA_ERR_INT_EN_LEN) - 1) << SDH_ADMA_ERR_INT_EN_POS))
#define SDH_TUNE_ERR_INT_EN                   SDH_TUNE_ERR_INT_EN
#define SDH_TUNE_ERR_INT_EN_POS               (10U)
#define SDH_TUNE_ERR_INT_EN_LEN               (1U)
#define SDH_TUNE_ERR_INT_EN_MSK               (((1U << SDH_TUNE_ERR_INT_EN_LEN) - 1) << SDH_TUNE_ERR_INT_EN_POS)
#define SDH_TUNE_ERR_INT_EN_UMSK              (~(((1U << SDH_TUNE_ERR_INT_EN_LEN) - 1) << SDH_TUNE_ERR_INT_EN_POS))
#define SDH_SPI_ERR_INT_EN                    SDH_SPI_ERR_INT_EN
#define SDH_SPI_ERR_INT_EN_POS                (12U)
#define SDH_SPI_ERR_INT_EN_LEN                (1U)
#define SDH_SPI_ERR_INT_EN_MSK                (((1U << SDH_SPI_ERR_INT_EN_LEN) - 1) << SDH_SPI_ERR_INT_EN_POS)
#define SDH_SPI_ERR_INT_EN_UMSK               (~(((1U << SDH_SPI_ERR_INT_EN_LEN) - 1) << SDH_SPI_ERR_INT_EN_POS))
#define SDH_AXI_RESP_ERR_INT_EN               SDH_AXI_RESP_ERR_INT_EN
#define SDH_AXI_RESP_ERR_INT_EN_POS           (13U)
#define SDH_AXI_RESP_ERR_INT_EN_LEN           (1U)
#define SDH_AXI_RESP_ERR_INT_EN_MSK           (((1U << SDH_AXI_RESP_ERR_INT_EN_LEN) - 1) << SDH_AXI_RESP_ERR_INT_EN_POS)
#define SDH_AXI_RESP_ERR_INT_EN_UMSK          (~(((1U << SDH_AXI_RESP_ERR_INT_EN_LEN) - 1) << SDH_AXI_RESP_ERR_INT_EN_POS))
#define SDH_CPL_TIMEOUT_ERR_INT_EN            SDH_CPL_TIMEOUT_ERR_INT_EN
#define SDH_CPL_TIMEOUT_ERR_INT_EN_POS        (14U)
#define SDH_CPL_TIMEOUT_ERR_INT_EN_LEN        (1U)
#define SDH_CPL_TIMEOUT_ERR_INT_EN_MSK        (((1U << SDH_CPL_TIMEOUT_ERR_INT_EN_LEN) - 1) << SDH_CPL_TIMEOUT_ERR_INT_EN_POS)
#define SDH_CPL_TIMEOUT_ERR_INT_EN_UMSK       (~(((1U << SDH_CPL_TIMEOUT_ERR_INT_EN_LEN) - 1) << SDH_CPL_TIMEOUT_ERR_INT_EN_POS))
#define SDH_CRC_STATUS_ERR_INT_EN             SDH_CRC_STATUS_ERR_INT_EN
#define SDH_CRC_STATUS_ERR_INT_EN_POS         (15U)
#define SDH_CRC_STATUS_ERR_INT_EN_LEN         (1U)
#define SDH_CRC_STATUS_ERR_INT_EN_MSK         (((1U << SDH_CRC_STATUS_ERR_INT_EN_LEN) - 1) << SDH_CRC_STATUS_ERR_INT_EN_POS)
#define SDH_CRC_STATUS_ERR_INT_EN_UMSK        (~(((1U << SDH_CRC_STATUS_ERR_INT_EN_LEN) - 1) << SDH_CRC_STATUS_ERR_INT_EN_POS))

