XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
/* 0x3C : Auto CMD12 Error Status Register */
#define SDH_SD_AUTO_CMD12_ERROR_STATUS_OFFSET (0x3C)
#define SDH_AUTO_CMD12_NOT_EXE                SDH_AUTO_CMD12_NOT_EXE
#define SDH_AUTO_CMD12_NOT_EXE_POS            (0U)
#define SDH_AUTO_CMD12_NOT_EXE_LEN            (1U)
#define SDH_AUTO_CMD12_NOT_EXE_MSK            (((1U << SDH_AUTO_CMD12_NOT_EXE_LEN) - 1) << SDH_AUTO_CMD12_NOT_EXE_POS)
#define SDH_AUTO_CMD12_NOT_EXE_UMSK           (~(((1U << SDH_AUTO_CMD12_NOT_EXE_LEN) - 1) << SDH_AUTO_CMD12_NOT_EXE_POS))
#define SDH_AUTO_CMD_TIMEOUT_ERR              SDH_AUTO_CMD_TIMEOUT_ERR
#define SDH_AUTO_CMD_TIMEOUT_ERR_POS          (1U)
#define SDH_AUTO_CMD_TIMEOUT_ERR_LEN          (1U)
#define SDH_AUTO_CMD_TIMEOUT_ERR_MSK          (((1U << SDH_AUTO_CMD_TIMEOUT_ERR_LEN) - 1) << SDH_AUTO_CMD_TIMEOUT_ERR_POS)
#define SDH_AUTO_CMD_TIMEOUT_ERR_UMSK         (~(((1U << SDH_AUTO_CMD_TIMEOUT_ERR_LEN) - 1) << SDH_AUTO_CMD_TIMEOUT_ERR_POS))
#define SDH_AUTO_CMD_CRC_ERR                  SDH_AUTO_CMD_CRC_ERR
#define SDH_AUTO_CMD_CRC_ERR_POS              (2U)
#define SDH_AUTO_CMD_CRC_ERR_LEN              (1U)
#define SDH_AUTO_CMD_CRC_ERR_MSK              (((1U << SDH_AUTO_CMD_CRC_ERR_LEN) - 1) << SDH_AUTO_CMD_CRC_ERR_POS)
#define SDH_AUTO_CMD_CRC_ERR_UMSK             (~(((1U << SDH_AUTO_CMD_CRC_ERR_LEN) - 1) << SDH_AUTO_CMD_CRC_ERR_POS))
#define SDH_AUTO_CMD_END_BIT_ERR              SDH_AUTO_CMD_END_BIT_ERR
#define SDH_AUTO_CMD_END_BIT_ERR_POS          (3U)
#define SDH_AUTO_CMD_END_BIT_ERR_LEN          (1U)
#define SDH_AUTO_CMD_END_BIT_ERR_MSK          (((1U << SDH_AUTO_CMD_END_BIT_ERR_LEN) - 1) << SDH_AUTO_CMD_END_BIT_ERR_POS)
#define SDH_AUTO_CMD_END_BIT_ERR_UMSK         (~(((1U << SDH_AUTO_CMD_END_BIT_ERR_LEN) - 1) << SDH_AUTO_CMD_END_BIT_ERR_POS))
#define SDH_AUTO_CMD_INDEX_ERR                SDH_AUTO_CMD_INDEX_ERR
#define SDH_AUTO_CMD_INDEX_ERR_POS            (4U)
#define SDH_AUTO_CMD_INDEX_ERR_LEN            (1U)
#define SDH_AUTO_CMD_INDEX_ERR_MSK            (((1U << SDH_AUTO_CMD_INDEX_ERR_LEN) - 1) << SDH_AUTO_CMD_INDEX_ERR_POS)
#define SDH_AUTO_CMD_INDEX_ERR_UMSK           (~(((1U << SDH_AUTO_CMD_INDEX_ERR_LEN) - 1) << SDH_AUTO_CMD_INDEX_ERR_POS))
#define SDH_CMD_NOT_ISSUED                    SDH_CMD_NOT_ISSUED
#define SDH_CMD_NOT_ISSUED_POS                (7U)
#define SDH_CMD_NOT_ISSUED_LEN                (1U)
#define SDH_CMD_NOT_ISSUED_MSK                (((1U << SDH_CMD_NOT_ISSUED_LEN) - 1) << SDH_CMD_NOT_ISSUED_POS)
#define SDH_CMD_NOT_ISSUED_UMSK               (~(((1U << SDH_CMD_NOT_ISSUED_LEN) - 1) << SDH_CMD_NOT_ISSUED_POS))

/* 0x3e : Host Control 2 Register */
#define SDH_HOST_CTRL_2_OFFSET    (0x3e)
#define SDH_UHS_MODE_SEL          SDH_UHS_MODE_SEL
#define SDH_UHS_MODE_SEL_POS      (0U)
#define SDH_UHS_MODE_SEL_LEN      (3U)
#define SDH_UHS_MODE_SEL_MSK      (((1U << SDH_UHS_MODE_SEL_LEN) - 1) << SDH_UHS_MODE_SEL_POS)
#define SDH_UHS_MODE_SEL_UMSK     (~(((1U << SDH_UHS_MODE_SEL_LEN) - 1) << SDH_UHS_MODE_SEL_POS))
#define SDH_SDH_V18_EN            SDH_SDH_V18_EN
#define SDH_SDH_V18_EN_POS        (3U)
#define SDH_SDH_V18_EN_LEN        (1U)
#define SDH_SDH_V18_EN_MSK        (((1U << SDH_SDH_V18_EN_LEN) - 1) << SDH_SDH_V18_EN_POS)
#define SDH_SDH_V18_EN_UMSK       (~(((1U << SDH_SDH_V18_EN_LEN) - 1) << SDH_SDH_V18_EN_POS))
#define SDH_DRV_STRENGTH_SEL      SDH_DRV_STRENGTH_SEL
#define SDH_DRV_STRENGTH_SEL_POS  (4U)
#define SDH_DRV_STRENGTH_SEL_LEN  (2U)
#define SDH_DRV_STRENGTH_SEL_MSK  (((1U << SDH_DRV_STRENGTH_SEL_LEN) - 1) << SDH_DRV_STRENGTH_SEL_POS)
#define SDH_DRV_STRENGTH_SEL_UMSK (~(((1U << SDH_DRV_STRENGTH_SEL_LEN) - 1) << SDH_DRV_STRENGTH_SEL_POS))
#define SDH_EXE_TUNING            SDH_EXE_TUNING
#define SDH_EXE_TUNING_POS        (6U)
#define SDH_EXE_TUNING_LEN        (1U)
#define SDH_EXE_TUNING_MSK        (((1U << SDH_EXE_TUNING_LEN) - 1) << SDH_EXE_TUNING_POS)
#define SDH_EXE_TUNING_UMSK       (~(((1U << SDH_EXE_TUNING_LEN) - 1) << SDH_EXE_TUNING_POS))
#define SDH_SAMPLING_CLK_SEL      SDH_SAMPLING_CLK_SEL
#define SDH_SAMPLING_CLK_SEL_POS  (7U)
#define SDH_SAMPLING_CLK_SEL_LEN  (1U)
#define SDH_SAMPLING_CLK_SEL_MSK  (((1U << SDH_SAMPLING_CLK_SEL_LEN) - 1) << SDH_SAMPLING_CLK_SEL_POS)
#define SDH_SAMPLING_CLK_SEL_UMSK (~(((1U << SDH_SAMPLING_CLK_SEL_LEN) - 1) << SDH_SAMPLING_CLK_SEL_POS))
#define SDH_ASYNC_INT_EN          SDH_ASYNC_INT_EN
#define SDH_ASYNC_INT_EN_POS      (14U)
#define SDH_ASYNC_INT_EN_LEN      (1U)
#define SDH_ASYNC_INT_EN_MSK      (((1U << SDH_ASYNC_INT_EN_LEN) - 1) << SDH_ASYNC_INT_EN_POS)
#define SDH_ASYNC_INT_EN_UMSK     (~(((1U << SDH_ASYNC_INT_EN_LEN) - 1) << SDH_ASYNC_INT_EN_POS))
#define SDH_PRE_VAL_EN            SDH_PRE_VAL_EN
#define SDH_PRE_VAL_EN_POS        (15U)
#define SDH_PRE_VAL_EN_LEN        (1U)
#define SDH_PRE_VAL_EN_MSK        (((1U << SDH_PRE_VAL_EN_LEN) - 1) << SDH_PRE_VAL_EN_POS)
#define SDH_PRE_VAL_EN_UMSK       (~(((1U << SDH_PRE_VAL_EN_LEN) - 1) << SDH_PRE_VAL_EN_POS))

/* 0x40 : Capabilities Register 1 */
#define SDH_SD_CAPABILITIES_1_OFFSET (0x40)
#define SDH_TIMEOUT_FREQ             SDH_TIMEOUT_FREQ
#define SDH_TIMEOUT_FREQ_POS         (0U)
#define SDH_TIMEOUT_FREQ_LEN         (6U)
#define SDH_TIMEOUT_FREQ_MSK         (((1U << SDH_TIMEOUT_FREQ_LEN) - 1) << SDH_TIMEOUT_FREQ_POS)
#define SDH_TIMEOUT_FREQ_UMSK        (~(((1U << SDH_TIMEOUT_FREQ_LEN) - 1) << SDH_TIMEOUT_FREQ_POS))
#define SDH_TIMEOUT_UNIT             SDH_TIMEOUT_UNIT
#define SDH_TIMEOUT_UNIT_POS         (7U)
#define SDH_TIMEOUT_UNIT_LEN         (1U)
#define SDH_TIMEOUT_UNIT_MSK         (((1U << SDH_TIMEOUT_UNIT_LEN) - 1) << SDH_TIMEOUT_UNIT_POS)
#define SDH_TIMEOUT_UNIT_UMSK        (~(((1U << SDH_TIMEOUT_UNIT_LEN) - 1) << SDH_TIMEOUT_UNIT_POS))
#define SDH_BASE_FREQ                SDH_BASE_FREQ
#define SDH_BASE_FREQ_POS            (8U)
#define SDH_BASE_FREQ_LEN            (8U)
#define SDH_BASE_FREQ_MSK            (((1U << SDH_BASE_FREQ_LEN) - 1) << SDH_BASE_FREQ_POS)
#define SDH_BASE_FREQ_UMSK           (~(((1U << SDH_BASE_FREQ_LEN) - 1) << SDH_BASE_FREQ_POS))

