XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
/* 0x42 : Capabilities Register 2 */
#define SDH_SD_CAPABILITIES_2_OFFSET   (0x42)
#define SDH_MAX_BLK_LEN                SDH_MAX_BLK_LEN
#define SDH_MAX_BLK_LEN_POS            (0U)
#define SDH_MAX_BLK_LEN_LEN            (2U)
#define SDH_MAX_BLK_LEN_MSK            (((1U << SDH_MAX_BLK_LEN_LEN) - 1) << SDH_MAX_BLK_LEN_POS)
#define SDH_MAX_BLK_LEN_UMSK           (~(((1U << SDH_MAX_BLK_LEN_LEN) - 1) << SDH_MAX_BLK_LEN_POS))
#define SDH_EX_DATA_WIDTH_SUPPORT      SDH_EX_DATA_WIDTH_SUPPORT
#define SDH_EX_DATA_WIDTH_SUPPORT_POS  (2U)
#define SDH_EX_DATA_WIDTH_SUPPORT_LEN  (1U)
#define SDH_EX_DATA_WIDTH_SUPPORT_MSK  (((1U << SDH_EX_DATA_WIDTH_SUPPORT_LEN) - 1) << SDH_EX_DATA_WIDTH_SUPPORT_POS)
#define SDH_EX_DATA_WIDTH_SUPPORT_UMSK (~(((1U << SDH_EX_DATA_WIDTH_SUPPORT_LEN) - 1) << SDH_EX_DATA_WIDTH_SUPPORT_POS))
#define SDH_ADMA2_SUPPORT              SDH_ADMA2_SUPPORT
#define SDH_ADMA2_SUPPORT_POS          (3U)
#define SDH_ADMA2_SUPPORT_LEN          (1U)
#define SDH_ADMA2_SUPPORT_MSK          (((1U << SDH_ADMA2_SUPPORT_LEN) - 1) << SDH_ADMA2_SUPPORT_POS)
#define SDH_ADMA2_SUPPORT_UMSK         (~(((1U << SDH_ADMA2_SUPPORT_LEN) - 1) << SDH_ADMA2_SUPPORT_POS))
#define SDH_ADMA1_SUPPORT              SDH_ADMA1_SUPPORT
#define SDH_ADMA1_SUPPORT_POS          (4U)
#define SDH_ADMA1_SUPPORT_LEN          (1U)
#define SDH_ADMA1_SUPPORT_MSK          (((1U << SDH_ADMA1_SUPPORT_LEN) - 1) << SDH_ADMA1_SUPPORT_POS)
#define SDH_ADMA1_SUPPORT_UMSK         (~(((1U << SDH_ADMA1_SUPPORT_LEN) - 1) << SDH_ADMA1_SUPPORT_POS))
#define SDH_HI_SPEED_SUPPORT           SDH_HI_SPEED_SUPPORT
#define SDH_HI_SPEED_SUPPORT_POS       (5U)
#define SDH_HI_SPEED_SUPPORT_LEN       (1U)
#define SDH_HI_SPEED_SUPPORT_MSK       (((1U << SDH_HI_SPEED_SUPPORT_LEN) - 1) << SDH_HI_SPEED_SUPPORT_POS)
#define SDH_HI_SPEED_SUPPORT_UMSK      (~(((1U << SDH_HI_SPEED_SUPPORT_LEN) - 1) << SDH_HI_SPEED_SUPPORT_POS))
#define SDH_SDMA_SUPPORT               SDH_SDMA_SUPPORT
#define SDH_SDMA_SUPPORT_POS           (6U)
#define SDH_SDMA_SUPPORT_LEN           (1U)
#define SDH_SDMA_SUPPORT_MSK           (((1U << SDH_SDMA_SUPPORT_LEN) - 1) << SDH_SDMA_SUPPORT_POS)
#define SDH_SDMA_SUPPORT_UMSK          (~(((1U << SDH_SDMA_SUPPORT_LEN) - 1) << SDH_SDMA_SUPPORT_POS))
#define SDH_SUS_RES_SUPPORT            SDH_SUS_RES_SUPPORT
#define SDH_SUS_RES_SUPPORT_POS        (7U)
#define SDH_SUS_RES_SUPPORT_LEN        (1U)
#define SDH_SUS_RES_SUPPORT_MSK        (((1U << SDH_SUS_RES_SUPPORT_LEN) - 1) << SDH_SUS_RES_SUPPORT_POS)
#define SDH_SUS_RES_SUPPORT_UMSK       (~(((1U << SDH_SUS_RES_SUPPORT_LEN) - 1) << SDH_SUS_RES_SUPPORT_POS))
#define SDH_VLG_33_SUPPORT             SDH_VLG_33_SUPPORT
#define SDH_VLG_33_SUPPORT_POS         (8U)
#define SDH_VLG_33_SUPPORT_LEN         (1U)
#define SDH_VLG_33_SUPPORT_MSK         (((1U << SDH_VLG_33_SUPPORT_LEN) - 1) << SDH_VLG_33_SUPPORT_POS)
#define SDH_VLG_33_SUPPORT_UMSK        (~(((1U << SDH_VLG_33_SUPPORT_LEN) - 1) << SDH_VLG_33_SUPPORT_POS))
#define SDH_VLG_30_SUPPORT             SDH_VLG_30_SUPPORT
#define SDH_VLG_30_SUPPORT_POS         (9U)
#define SDH_VLG_30_SUPPORT_LEN         (1U)
#define SDH_VLG_30_SUPPORT_MSK         (((1U << SDH_VLG_30_SUPPORT_LEN) - 1) << SDH_VLG_30_SUPPORT_POS)
#define SDH_VLG_30_SUPPORT_UMSK        (~(((1U << SDH_VLG_30_SUPPORT_LEN) - 1) << SDH_VLG_30_SUPPORT_POS))
#define SDH_VLG_18_SUPPORT             SDH_VLG_18_SUPPORT
#define SDH_VLG_18_SUPPORT_POS         (10U)
#define SDH_VLG_18_SUPPORT_LEN         (1U)
#define SDH_VLG_18_SUPPORT_MSK         (((1U << SDH_VLG_18_SUPPORT_LEN) - 1) << SDH_VLG_18_SUPPORT_POS)
#define SDH_VLG_18_SUPPORT_UMSK        (~(((1U << SDH_VLG_18_SUPPORT_LEN) - 1) << SDH_VLG_18_SUPPORT_POS))
#define SDH_SYS_BUS_64_SUPPORT         SDH_SYS_BUS_64_SUPPORT
#define SDH_SYS_BUS_64_SUPPORT_POS     (12U)
#define SDH_SYS_BUS_64_SUPPORT_LEN     (1U)
#define SDH_SYS_BUS_64_SUPPORT_MSK     (((1U << SDH_SYS_BUS_64_SUPPORT_LEN) - 1) << SDH_SYS_BUS_64_SUPPORT_POS)
#define SDH_SYS_BUS_64_SUPPORT_UMSK    (~(((1U << SDH_SYS_BUS_64_SUPPORT_LEN) - 1) << SDH_SYS_BUS_64_SUPPORT_POS))
#define SDH_ASYNC_INT_SUPPORT          SDH_ASYNC_INT_SUPPORT
#define SDH_ASYNC_INT_SUPPORT_POS      (13U)
#define SDH_ASYNC_INT_SUPPORT_LEN      (1U)
#define SDH_ASYNC_INT_SUPPORT_MSK      (((1U << SDH_ASYNC_INT_SUPPORT_LEN) - 1) << SDH_ASYNC_INT_SUPPORT_POS)
#define SDH_ASYNC_INT_SUPPORT_UMSK     (~(((1U << SDH_ASYNC_INT_SUPPORT_LEN) - 1) << SDH_ASYNC_INT_SUPPORT_POS))
#define SDH_CFG_SLOT_TYPE              SDH_CFG_SLOT_TYPE
#define SDH_CFG_SLOT_TYPE_POS          (14U)
#define SDH_CFG_SLOT_TYPE_LEN          (2U)
#define SDH_CFG_SLOT_TYPE_MSK          (((1U << SDH_CFG_SLOT_TYPE_LEN) - 1) << SDH_CFG_SLOT_TYPE_POS)
#define SDH_CFG_SLOT_TYPE_UMSK         (~(((1U << SDH_CFG_SLOT_TYPE_LEN) - 1) << SDH_CFG_SLOT_TYPE_POS))

/* 0x44 : Capabilities Register 3 */
#define SDH_SD_CAPABILITIES_3_OFFSET (0x44)
#define SDH_SDR50_SUPPORT            SDH_SDR50_SUPPORT
#define SDH_SDR50_SUPPORT_POS        (0U)
#define SDH_SDR50_SUPPORT_LEN        (1U)
#define SDH_SDR50_SUPPORT_MSK        (((1U << SDH_SDR50_SUPPORT_LEN) - 1) << SDH_SDR50_SUPPORT_POS)
#define SDH_SDR50_SUPPORT_UMSK       (~(((1U << SDH_SDR50_SUPPORT_LEN) - 1) << SDH_SDR50_SUPPORT_POS))
#define SDH_SDR104_SUPPORT           SDH_SDR104_SUPPORT
#define SDH_SDR104_SUPPORT_POS       (1U)
#define SDH_SDR104_SUPPORT_LEN       (1U)
#define SDH_SDR104_SUPPORT_MSK       (((1U << SDH_SDR104_SUPPORT_LEN) - 1) << SDH_SDR104_SUPPORT_POS)
#define SDH_SDR104_SUPPORT_UMSK      (~(((1U << SDH_SDR104_SUPPORT_LEN) - 1) << SDH_SDR104_SUPPORT_POS))
#define SDH_DDR50_SUPPORT            SDH_DDR50_SUPPORT
#define SDH_DDR50_SUPPORT_POS        (2U)
#define SDH_DDR50_SUPPORT_LEN        (1U)
#define SDH_DDR50_SUPPORT_MSK        (((1U << SDH_DDR50_SUPPORT_LEN) - 1) << SDH_DDR50_SUPPORT_POS)
#define SDH_DDR50_SUPPORT_UMSK       (~(((1U << SDH_DDR50_SUPPORT_LEN) - 1) << SDH_DDR50_SUPPORT_POS))
#define SDH_DRV_TYPE_A               SDH_DRV_TYPE_A
#define SDH_DRV_TYPE_A_POS           (4U)
#define SDH_DRV_TYPE_A_LEN           (1U)
#define SDH_DRV_TYPE_A_MSK           (((1U << SDH_DRV_TYPE_A_LEN) - 1) << SDH_DRV_TYPE_A_POS)
#define SDH_DRV_TYPE_A_UMSK          (~(((1U << SDH_DRV_TYPE_A_LEN) - 1) << SDH_DRV_TYPE_A_POS))
#define SDH_DRV_TYPE_C               SDH_DRV_TYPE_C
#define SDH_DRV_TYPE_C_POS           (5U)
#define SDH_DRV_TYPE_C_LEN           (1U)
#define SDH_DRV_TYPE_C_MSK           (((1U << SDH_DRV_TYPE_C_LEN) - 1) << SDH_DRV_TYPE_C_POS)
#define SDH_DRV_TYPE_C_UMSK          (~(((1U << SDH_DRV_TYPE_C_LEN) - 1) << SDH_DRV_TYPE_C_POS))
#define SDH_DRV_TYPE_D               SDH_DRV_TYPE_D
#define SDH_DRV_TYPE_D_POS           (6U)
#define SDH_DRV_TYPE_D_LEN           (1U)
#define SDH_DRV_TYPE_D_MSK           (((1U << SDH_DRV_TYPE_D_LEN) - 1) << SDH_DRV_TYPE_D_POS)
#define SDH_DRV_TYPE_D_UMSK          (~(((1U << SDH_DRV_TYPE_D_LEN) - 1) << SDH_DRV_TYPE_D_POS))
#define SDH_TMR_RETUNE               SDH_TMR_RETUNE
#define SDH_TMR_RETUNE_POS           (8U)
#define SDH_TMR_RETUNE_LEN           (4U)
#define SDH_TMR_RETUNE_MSK           (((1U << SDH_TMR_RETUNE_LEN) - 1) << SDH_TMR_RETUNE_POS)
#define SDH_TMR_RETUNE_UMSK          (~(((1U << SDH_TMR_RETUNE_LEN) - 1) << SDH_TMR_RETUNE_POS))
#define SDH_SDR50_TUNE               SDH_SDR50_TUNE
#define SDH_SDR50_TUNE_POS           (13U)
#define SDH_SDR50_TUNE_LEN           (1U)
#define SDH_SDR50_TUNE_MSK           (((1U << SDH_SDR50_TUNE_LEN) - 1) << SDH_SDR50_TUNE_POS)
#define SDH_SDR50_TUNE_UMSK          (~(((1U << SDH_SDR50_TUNE_LEN) - 1) << SDH_SDR50_TUNE_POS))
#define SDH_RETUNE_MODES             SDH_RETUNE_MODES
#define SDH_RETUNE_MODES_POS         (14U)
#define SDH_RETUNE_MODES_LEN         (2U)
#define SDH_RETUNE_MODES_MSK         (((1U << SDH_RETUNE_MODES_LEN) - 1) << SDH_RETUNE_MODES_POS)
#define SDH_RETUNE_MODES_UMSK        (~(((1U << SDH_RETUNE_MODES_LEN) - 1) << SDH_RETUNE_MODES_POS))

