XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
/* 0x5E : ADMA System Address Register 4 */
#define SDH_SD_ADMA_SYS_ADDR_4_OFFSET (0x5E)
#define SDH_ADMA_SYS_ADDR             SDH_ADMA_SYS_ADDR
#define SDH_ADMA_SYS_ADDR_POS         (0U)
#define SDH_ADMA_SYS_ADDR_LEN         (16U)
#define SDH_ADMA_SYS_ADDR_MSK         (((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS)
#define SDH_ADMA_SYS_ADDR_UMSK        (~(((1U << SDH_ADMA_SYS_ADDR_LEN) - 1) << SDH_ADMA_SYS_ADDR_POS))

/* 0x60 : Preset Value Register for Initialization */
#define SDH_PRESET_VALUE_FOR_INIT_OFFSET (0x60)
#define SDH_SDCLK_FREQ_SEL_VAL           SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS       (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN       (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK       (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK      (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL               SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS           (10U)
#define SDH_CLKGEN_SEL_VAL_LEN           (1U)
#define SDH_CLKGEN_SEL_VAL_MSK           (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK          (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL             SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS         (14U)
#define SDH_DRV_STRENGTH_VAL_LEN         (2U)
#define SDH_DRV_STRENGTH_VAL_MSK         (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK        (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x62 : Preset Value Register for Default Speed */
#define SDH_PRESET_VALUE_FOR_DS_OFFSET (0x62)
#define SDH_SDCLK_FREQ_SEL_VAL         SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS     (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN     (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK     (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK    (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL             SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS         (10U)
#define SDH_CLKGEN_SEL_VAL_LEN         (1U)
#define SDH_CLKGEN_SEL_VAL_MSK         (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK        (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL           SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS       (14U)
#define SDH_DRV_STRENGTH_VAL_LEN       (2U)
#define SDH_DRV_STRENGTH_VAL_MSK       (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK      (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x64 : Preset Value Register for High Speed */
#define SDH_PRESET_VALUE_FOR_HS_OFFSET (0x64)
#define SDH_SDCLK_FREQ_SEL_VAL         SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS     (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN     (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK     (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK    (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL             SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS         (10U)
#define SDH_CLKGEN_SEL_VAL_LEN         (1U)
#define SDH_CLKGEN_SEL_VAL_MSK         (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK        (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL           SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS       (14U)
#define SDH_DRV_STRENGTH_VAL_LEN       (2U)
#define SDH_DRV_STRENGTH_VAL_MSK       (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK      (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x66 : Preset Value Register for SDR12 */
#define SDH_PRESET_VALUE_FOR_SDR12_OFFSET (0x66)
#define SDH_SDCLK_FREQ_SEL_VAL            SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS        (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN        (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK        (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK       (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL                SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS            (10U)
#define SDH_CLKGEN_SEL_VAL_LEN            (1U)
#define SDH_CLKGEN_SEL_VAL_MSK            (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK           (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL              SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS          (14U)
#define SDH_DRV_STRENGTH_VAL_LEN          (2U)
#define SDH_DRV_STRENGTH_VAL_MSK          (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK         (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x68 : Preset Value Register for SDR25 */
#define SDH_PRESET_VALUE_FOR_SDR25_OFFSET (0x68)
#define SDH_SDCLK_FREQ_SEL_VAL            SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS        (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN        (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK        (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK       (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL                SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS            (10U)
#define SDH_CLKGEN_SEL_VAL_LEN            (1U)
#define SDH_CLKGEN_SEL_VAL_MSK            (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK           (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL              SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS          (14U)
#define SDH_DRV_STRENGTH_VAL_LEN          (2U)
#define SDH_DRV_STRENGTH_VAL_MSK          (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK         (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x6a : Preset Value Register for SDR50 */
#define SDH_PRESET_VALUE_FOR_SDR50_OFFSET (0x6a)
#define SDH_SDCLK_FREQ_SEL_VAL            SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS        (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN        (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK        (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK       (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL                SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS            (10U)
#define SDH_CLKGEN_SEL_VAL_LEN            (1U)
#define SDH_CLKGEN_SEL_VAL_MSK            (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK           (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL              SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS          (14U)
#define SDH_DRV_STRENGTH_VAL_LEN          (2U)
#define SDH_DRV_STRENGTH_VAL_MSK          (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK         (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x6c : Preset Value Register for SDR104 */
#define SDH_PRESET_VALUE_FOR_SDR104_OFFSET (0x6c)
#define SDH_SDCLK_FREQ_SEL_VAL             SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS         (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN         (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK         (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK        (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL                 SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS             (10U)
#define SDH_CLKGEN_SEL_VAL_LEN             (1U)
#define SDH_CLKGEN_SEL_VAL_MSK             (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK            (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL               SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS           (14U)
#define SDH_DRV_STRENGTH_VAL_LEN           (2U)
#define SDH_DRV_STRENGTH_VAL_MSK           (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK          (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0x6e : Preset Value Register for DDR50 */
#define SDH_PRESET_VALUE_FOR_DDR50_OFFSET (0x6e)
#define SDH_SDCLK_FREQ_SEL_VAL            SDH_SDCLK_FREQ_SEL_VAL
#define SDH_SDCLK_FREQ_SEL_VAL_POS        (0U)
#define SDH_SDCLK_FREQ_SEL_VAL_LEN        (10U)
#define SDH_SDCLK_FREQ_SEL_VAL_MSK        (((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS)
#define SDH_SDCLK_FREQ_SEL_VAL_UMSK       (~(((1U << SDH_SDCLK_FREQ_SEL_VAL_LEN) - 1) << SDH_SDCLK_FREQ_SEL_VAL_POS))
#define SDH_CLKGEN_SEL_VAL                SDH_CLKGEN_SEL_VAL
#define SDH_CLKGEN_SEL_VAL_POS            (10U)
#define SDH_CLKGEN_SEL_VAL_LEN            (1U)
#define SDH_CLKGEN_SEL_VAL_MSK            (((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS)
#define SDH_CLKGEN_SEL_VAL_UMSK           (~(((1U << SDH_CLKGEN_SEL_VAL_LEN) - 1) << SDH_CLKGEN_SEL_VAL_POS))
#define SDH_DRV_STRENGTH_VAL              SDH_DRV_STRENGTH_VAL
#define SDH_DRV_STRENGTH_VAL_POS          (14U)
#define SDH_DRV_STRENGTH_VAL_LEN          (2U)
#define SDH_DRV_STRENGTH_VAL_MSK          (((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS)
#define SDH_DRV_STRENGTH_VAL_UMSK         (~(((1U << SDH_DRV_STRENGTH_VAL_LEN) - 1) << SDH_DRV_STRENGTH_VAL_POS))

/* 0xe0 : Shared Bus Control Register */
#define SDH_SHARED_BUS_CTRL_OFFSET (0xe0)
#define SDH_NUM_CLK_PINS           SDH_NUM_CLK_PINS
#define SDH_NUM_CLK_PINS_POS       (0U)
#define SDH_NUM_CLK_PINS_LEN       (3U)
#define SDH_NUM_CLK_PINS_MSK       (((1U << SDH_NUM_CLK_PINS_LEN) - 1) << SDH_NUM_CLK_PINS_POS)
#define SDH_NUM_CLK_PINS_UMSK      (~(((1U << SDH_NUM_CLK_PINS_LEN) - 1) << SDH_NUM_CLK_PINS_POS))
#define SDH_NUM_INT_PINS           SDH_NUM_INT_PINS
#define SDH_NUM_INT_PINS_POS       (4U)
#define SDH_NUM_INT_PINS_LEN       (2U)
#define SDH_NUM_INT_PINS_MSK       (((1U << SDH_NUM_INT_PINS_LEN) - 1) << SDH_NUM_INT_PINS_POS)
#define SDH_NUM_INT_PINS_UMSK      (~(((1U << SDH_NUM_INT_PINS_LEN) - 1) << SDH_NUM_INT_PINS_POS))
#define SDH_BUS_WIDTH_PRESET       SDH_BUS_WIDTH_PRESET
#define SDH_BUS_WIDTH_PRESET_POS   (8U)
#define SDH_BUS_WIDTH_PRESET_LEN   (7U)
#define SDH_BUS_WIDTH_PRESET_MSK   (((1U << SDH_BUS_WIDTH_PRESET_LEN) - 1) << SDH_BUS_WIDTH_PRESET_POS)
#define SDH_BUS_WIDTH_PRESET_UMSK  (~(((1U << SDH_BUS_WIDTH_PRESET_LEN) - 1) << SDH_BUS_WIDTH_PRESET_POS))
#define SDH_CLK_PIN_SEL            SDH_CLK_PIN_SEL
#define SDH_CLK_PIN_SEL_POS        (16U)
#define SDH_CLK_PIN_SEL_LEN        (3U)
#define SDH_CLK_PIN_SEL_MSK        (((1U << SDH_CLK_PIN_SEL_LEN) - 1) << SDH_CLK_PIN_SEL_POS)
#define SDH_CLK_PIN_SEL_UMSK       (~(((1U << SDH_CLK_PIN_SEL_LEN) - 1) << SDH_CLK_PIN_SEL_POS))
#define SDH_INT_PIN_SEL            SDH_INT_PIN_SEL
#define SDH_INT_PIN_SEL_POS        (20U)
#define SDH_INT_PIN_SEL_LEN        (3U)
#define SDH_INT_PIN_SEL_MSK        (((1U << SDH_INT_PIN_SEL_LEN) - 1) << SDH_INT_PIN_SEL_POS)
#define SDH_INT_PIN_SEL_UMSK       (~(((1U << SDH_INT_PIN_SEL_LEN) - 1) << SDH_INT_PIN_SEL_POS))
#define SDH_BEND_PWR_CTRL          SDH_BEND_PWR_CTRL
#define SDH_BEND_PWR_CTRL_POS      (24U)
#define SDH_BEND_PWR_CTRL_LEN      (7U)
#define SDH_BEND_PWR_CTRL_MSK      (((1U << SDH_BEND_PWR_CTRL_LEN) - 1) << SDH_BEND_PWR_CTRL_POS)
#define SDH_BEND_PWR_CTRL_UMSK     (~(((1U << SDH_BEND_PWR_CTRL_LEN) - 1) << SDH_BEND_PWR_CTRL_POS))

/* 0xFC : Slot Interrupt Status Register */
#define SDH_SD_SLOT_INT_STATUS_OFFSET (0xFC)
#define SDH_SLOT_INT0                 SDH_SLOT_INT0
#define SDH_SLOT_INT0_POS             (0U)
#define SDH_SLOT_INT0_LEN             (1U)
#define SDH_SLOT_INT0_MSK             (((1U << SDH_SLOT_INT0_LEN) - 1) << SDH_SLOT_INT0_POS)
#define SDH_SLOT_INT0_UMSK            (~(((1U << SDH_SLOT_INT0_LEN) - 1) << SDH_SLOT_INT0_POS))
#define SDH_SLOT_INT1                 SDH_SLOT_INT1
#define SDH_SLOT_INT1_POS             (1U)
#define SDH_SLOT_INT1_LEN             (1U)
#define SDH_SLOT_INT1_MSK             (((1U << SDH_SLOT_INT1_LEN) - 1) << SDH_SLOT_INT1_POS)
#define SDH_SLOT_INT1_UMSK            (~(((1U << SDH_SLOT_INT1_LEN) - 1) << SDH_SLOT_INT1_POS))

/* 0xFE : Host Control Version Register */
#define SDH_SD_HOST_CTRL_VER_OFFSET (0xFE)
#define SDH_SD_VER                  SDH_SD_VER
#define SDH_SD_VER_POS              (0U)
#define SDH_SD_VER_LEN              (8U)
#define SDH_SD_VER_MSK              (((1U << SDH_SD_VER_LEN) - 1) << SDH_SD_VER_POS)
#define SDH_SD_VER_UMSK             (~(((1U << SDH_SD_VER_LEN) - 1) << SDH_SD_VER_POS))
#define SDH_VENDOR_VER              SDH_VENDOR_VER
#define SDH_VENDOR_VER_POS          (8U)
#define SDH_VENDOR_VER_LEN          (8U)
#define SDH_VENDOR_VER_MSK          (((1U << SDH_VENDOR_VER_LEN) - 1) << SDH_VENDOR_VER_POS)
#define SDH_VENDOR_VER_UMSK         (~(((1U << SDH_VENDOR_VER_LEN) - 1) << SDH_VENDOR_VER_POS))

/* 0x100 : SD Extra Parameters Register */
#define SDH_SD_CFG_FIFO_PARAM_OFFSET (0x100)
#define SDH_BOOT_ACK                 SDH_BOOT_ACK
#define SDH_BOOT_ACK_POS             (3U)
#define SDH_BOOT_ACK_LEN             (1U)
#define SDH_BOOT_ACK_MSK             (((1U << SDH_BOOT_ACK_LEN) - 1) << SDH_BOOT_ACK_POS)
#define SDH_BOOT_ACK_UMSK            (~(((1U << SDH_BOOT_ACK_LEN) - 1) << SDH_BOOT_ACK_POS))
#define SDH_SQU_EMPTY_CHK            SDH_SQU_EMPTY_CHK
#define SDH_SQU_EMPTY_CHK_POS        (4U)
#define SDH_SQU_EMPTY_CHK_LEN        (1U)
#define SDH_SQU_EMPTY_CHK_MSK        (((1U << SDH_SQU_EMPTY_CHK_LEN) - 1) << SDH_SQU_EMPTY_CHK_POS)
#define SDH_SQU_EMPTY_CHK_UMSK       (~(((1U << SDH_SQU_EMPTY_CHK_LEN) - 1) << SDH_SQU_EMPTY_CHK_POS))
#define SDH_SQU_FULL_CHK             SDH_SQU_FULL_CHK
#define SDH_SQU_FULL_CHK_POS         (5U)
#define SDH_SQU_FULL_CHK_LEN         (1U)
#define SDH_SQU_FULL_CHK_MSK         (((1U << SDH_SQU_FULL_CHK_LEN) - 1) << SDH_SQU_FULL_CHK_POS)
#define SDH_SQU_FULL_CHK_UMSK        (~(((1U << SDH_SQU_FULL_CHK_LEN) - 1) << SDH_SQU_FULL_CHK_POS))
#define SDH_GEN_PAD_CLK_ON           SDH_GEN_PAD_CLK_ON
#define SDH_GEN_PAD_CLK_ON_POS       (6U)
#define SDH_GEN_PAD_CLK_ON_LEN       (1U)
#define SDH_GEN_PAD_CLK_ON_MSK       (((1U << SDH_GEN_PAD_CLK_ON_LEN) - 1) << SDH_GEN_PAD_CLK_ON_POS)
#define SDH_GEN_PAD_CLK_ON_UMSK      (~(((1U << SDH_GEN_PAD_CLK_ON_LEN) - 1) << SDH_GEN_PAD_CLK_ON_POS))
#define SDH_GEN_PAD_CLK_CNT          SDH_GEN_PAD_CLK_CNT
#define SDH_GEN_PAD_CLK_CNT_POS      (24U)
#define SDH_GEN_PAD_CLK_CNT_LEN      (8U)
#define SDH_GEN_PAD_CLK_CNT_MSK      (((1U << SDH_GEN_PAD_CLK_CNT_LEN) - 1) << SDH_GEN_PAD_CLK_CNT_POS)
#define SDH_GEN_PAD_CLK_CNT_UMSK     (~(((1U << SDH_GEN_PAD_CLK_CNT_LEN) - 1) << SDH_GEN_PAD_CLK_CNT_POS))

