XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
    /* 0x46 : Capabilities Register 4 */
    union {
        struct
        {
            uint16_t clk_multiplier : 8; /* [ 7: 0],         RO,        0x0 */
            uint16_t Reserved_15_8  : 8; /* [15: 8],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CAPABILITIES_4;

    /* 0x48 : Maximum Current Register 1 */
    union {
        struct
        {
            uint16_t MAX_CUR_33 : 8; /* [ 7: 0],         RO,        0x0 */
            uint16_t MAX_CUR_30 : 8; /* [15: 8],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_MAX_CURRENT_1;

    /* 0x4A : Maximum Current Register 2 */
    union {
        struct
        {
            uint16_t MAX_CUR_18    : 8; /* [ 7: 0],         RO,        0x0 */
            uint16_t Reserved_15_8 : 8; /* [15: 8],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_MAX_CURRENT_2;

    /* 0x4C : Maximum Current Register 3 */
    union {
        struct
        {
            uint16_t Reserved_15_0 : 16; /* [15: 0],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_MAX_CURRENT_3;

    /* 0x4E : Maximum Current Register 4 */
    union {
        struct
        {
            uint16_t Reserved_15_0 : 16; /* [15: 0],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_MAX_CURRENT_4;

    /* 0x50 : Force Event Auto cmd12 Error Register */
    union {
        struct
        {
            uint16_t F_ACMD12_NEXE_ERR  : 1; /* [    0],         WO,        0x0 */
            uint16_t F_ACMD_TO_ERR      : 1; /* [    1],         WO,        0x0 */
            uint16_t F_ACMD_CRC_ERR     : 1; /* [    2],         WO,        0x0 */
            uint16_t F__ACMD_EBIT_ERR   : 1; /* [    3],         WO,        0x0 */
            uint16_t F_ACMD_INDEX_ERR   : 1; /* [    4],         WO,        0x0 */
            uint16_t Reserved_6_5       : 2; /* [ 6: 5],       RSVD,        0x0 */
            uint16_t F_ACMD12_ISSUE_ERR : 1; /* [    7],         WO,        0x0 */
            uint16_t Reserved_15_8      : 8; /* [15: 8],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_FORCE_EVENT_AUTO_CMD12_ERROR;

    /* 0x52 : Force Event for Error Status Register */
    union {
        struct
        {
            uint16_t F_CMD_TO_ERR      : 1; /* [    0],         WO,        0x0 */
            uint16_t F_CMD_CRC_ERR     : 1; /* [    1],         WO,        0x0 */
            uint16_t F_CMD_END_BIT_ERR : 1; /* [    2],         WO,        0x0 */
            uint16_t F_CMD_INDEX_ERR   : 1; /* [    3],         WO,        0x0 */
            uint16_t F_DAT_TO_ERR      : 1; /* [    4],         WO,        0x0 */
            uint16_t F_DAT_CRC_ERR     : 1; /* [    5],         WO,        0x0 */
            uint16_t F_DAT_END_BIT_ERR : 1; /* [    6],         WO,        0x0 */
            uint16_t F_CURRENT_ERR     : 1; /* [    7],         WO,        0x0 */
            uint16_t F_ACMD12_ERR      : 1; /* [    8],         WO,        0x0 */
            uint16_t F_ADMA_ERR        : 1; /* [    9],         WO,        0x0 */
            uint16_t Reserved_11_10    : 2; /* [11:10],       RSVD,        0x0 */
            uint16_t F_SPI_ERR         : 1; /* [   12],         WO,        0x0 */
            uint16_t F_AXI_RESP_ERR    : 1; /* [   13],         WO,        0x0 */
            uint16_t F_CPL_TIMEOUT_ERR : 1; /* [   14],         WO,        0x0 */
            uint16_t F_CRC_STATUS_ERR  : 1; /* [   15],         WO,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_FORCE_EVENT_FOR_ERROR_STATUS;

    /* 0x54 : ADMA Error Status Register */
    union {
        struct
        {
            uint16_t ADMA_STATE    : 2;  /* [ 1: 0],         RW,        0x0 */
            uint16_t ADMA_LEN_ERR  : 1;  /* [    2],         RW,        0x0 */
            uint16_t Reserved_15_3 : 13; /* [15: 3],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ADMA_ERROR_STATUS;

    /* 0x56  reserved */
    uint8_t RESERVED0x56[2];

    /* 0x58 : ADMA System Address Register 1 */
    union {
        struct
        {
            uint16_t ADMA_SYS_ADDR : 16; /* [15: 0],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ADMA_SYS_ADDR_1;

    /* 0x5A : ADMA System Address Register 2 */
    union {
        struct
        {
            uint16_t ADMA_SYS_ADDR : 16; /* [15: 0],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ADMA_SYS_ADDR_2;

    /* 0x5C : ADMA System Address Register 3 */
    union {
        struct
        {
            uint16_t ADMA_SYS_ADDR : 16; /* [15: 0],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ADMA_SYS_ADDR_3;

    /* 0x5E : ADMA System Address Register 4 */
    union {
        struct
        {
            uint16_t ADMA_SYS_ADDR : 16; /* [15: 0],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_ADMA_SYS_ADDR_4;

    /* 0x60 : Preset Value Register for Initialization */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x100 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_INIT;

    /* 0x62 : Preset Value Register for Default Speed */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x004 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_DS;

