XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
    /* 0x64 : Preset Value Register for High Speed */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x002 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_HS;

    /* 0x66 : Preset Value Register for SDR12 */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x004 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_SDR12;

    /* 0x68 : Preset Value Register for SDR25 */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x002 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_SDR25;

    /* 0x6a : Preset Value Register for SDR50 */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x001 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_SDR50;

    /* 0x6c : Preset Value Register for SDR104 */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,        0x0 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_SDR104;

    /* 0x6e : Preset Value Register for DDR50 */
    union {
        struct
        {
            uint16_t SDCLK_FREQ_SEL_VAL : 10; /* [ 9: 0],         RO,      0x002 */
            uint16_t CLKGEN_SEL_VAL     : 1;  /* [   10],         RO,        0x0 */
            uint16_t Reserved_13_11     : 3;  /* [13:11],       RSVD,        0x0 */
            uint16_t DRV_STRENGTH_VAL   : 2;  /* [15:14],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } PRESET_VALUE_FOR_DDR50;

    /* 0x70  reserved */
    uint8_t RESERVED0x70[112];

    /* 0xe0 : Shared Bus Control Register */
    union {
        struct
        {
            uint32_t NUM_CLK_PINS     : 3; /* [ 2: 0],         RO,        0x0 */
            uint32_t Reserved_3       : 1; /* [    3],       RSVD,        0x0 */
            uint32_t NUM_INT_PINS     : 2; /* [ 5: 4],         RO,        0x0 */
            uint32_t Reserved_7_6     : 2; /* [ 7: 6],       RSVD,        0x0 */
            uint32_t BUS_WIDTH_PRESET : 7; /* [14: 8],         RO,        0x0 */
            uint32_t Reserved_15      : 1; /* [   15],       RSVD,        0x0 */
            uint32_t CLK_PIN_SEL      : 3; /* [18:16],         RW,        0x0 */
            uint32_t Reserved_19      : 1; /* [   19],       RSVD,        0x0 */
            uint32_t INT_PIN_SEL      : 3; /* [22:20],         RW,        0x0 */
            uint32_t Reserved_23      : 1; /* [   23],       RSVD,        0x0 */
            uint32_t BEND_PWR_CTRL    : 7; /* [30:24],         RW,        0x0 */
            uint32_t Reserved_31      : 1; /* [   31],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } SHARED_BUS_CTRL;

    /* 0xe4  reserved */
    uint8_t RESERVED0xe4[24];

    /* 0xFC : Slot Interrupt Status Register */
    union {
        struct
        {
            uint16_t SLOT_INT0     : 1;  /* [    0],         RO,        0x0 */
            uint16_t SLOT_INT1     : 1;  /* [    1],         RO,        0x0 */
            uint16_t Reserved_15_2 : 14; /* [15: 2],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_SLOT_INT_STATUS;

    /* 0xFE : Host Control Version Register */
    union {
        struct
        {
            uint16_t SD_VER     : 8; /* [ 7: 0],         RO,        0x2 */
            uint16_t VENDOR_VER : 8; /* [15: 8],         RO,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_HOST_CTRL_VER;

    /* 0x100 : SD Extra Parameters Register */
    union {
        struct
        {
            uint32_t Reserved_0      : 1;  /* [    0],       RSVD,        0x0 */
            uint32_t Reserved_2_1    : 2;  /* [ 2: 1],       RSVD,        0x0 */
            uint32_t BOOT_ACK        : 1;  /* [    3],         RW,        0x0 */
            uint32_t SQU_EMPTY_CHK   : 1;  /* [    4],         RW,        0x0 */
            uint32_t SQU_FULL_CHK    : 1;  /* [    5],         RW,        0x0 */
            uint32_t GEN_PAD_CLK_ON  : 1;  /* [    6],       RWAC,        0x0 */
            uint32_t Reserved_23_7   : 17; /* [23: 7],       RSVD,        0x0 */
            uint32_t GEN_PAD_CLK_CNT : 8;  /* [31:24],         RW,       0x4a */
        } BF;
        uint32_t WORD;
    } SD_CFG_FIFO_PARAM;

    /* 0x104 : FIFO Parameters Register */
    union {
        struct
        {
            uint32_t RTC              : 2;  /* [ 1: 0],         RW,        0x1 */
            uint32_t WTC              : 2;  /* [ 3: 2],         RW,        0x1 */
            uint32_t FIFO_CLK         : 1;  /* [    4],         RW,        0x0 */
            uint32_t FIFO_CS          : 1;  /* [    5],         RW,        0x0 */
            uint32_t PDWN             : 1;  /* [    6],         RW,        0x0 */
            uint32_t use_dat3         : 1;  /* [    7],         RW,        0x0 */
            uint32_t CLK_GATE_CTL     : 1;  /* [    8],         RW,        0x0 */
            uint32_t CLK_GATE_ON      : 1;  /* [    9],         RW,        0x0 */
            uint32_t Reserved_10      : 1;  /* [   10],       RSVD,        0x0 */
            uint32_t OVRRD_CLK_OEN    : 1;  /* [   11],         RW,        0x0 */
            uint32_t FORCE_CLK_ON     : 1;  /* [   12],         RW,        0x0 */
            uint32_t PDFVSSM          : 1;  /* [   13],         RW,        0x0 */
            uint32_t PDLVMC           : 1;  /* [   14],         RW,        0x0 */
            uint32_t Reserved_15      : 1;  /* [   15],       RSVD,        0x0 */
            uint32_t PRE_GATE_CLK_CNT : 4;  /* [19:16],         RW,        0x7 */
            uint32_t Reserved_31_20   : 12; /* [31:20],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } SD_FIFO_PARAM;

    /* 0x108 : SPI Mode Register */
    union {
        struct
        {
            uint16_t SPI_EN         : 1; /* [    0],         RW,        0x0 */
            uint16_t Reserved_7_1   : 7; /* [ 7: 1],       RSVD,        0x0 */
            uint16_t SPI_ERR_TOKEN  : 5; /* [12: 8],         RW,        0x0 */
            uint16_t Reserved_15_13 : 3; /* [15:13],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_SPI_MODE;

    /* 0x10a : Clock and Burst Size Setup Register */
    union {
        struct
        {
            uint16_t BRST_SIZE       : 2; /* [ 1: 0],         RW,        0x2 */
            uint16_t DMA_SIZE        : 2; /* [ 3: 2],         RW,        0x3 */
            uint16_t priority        : 1; /* [    4],         RW,        0x0 */
            uint16_t AXI_NON_POST_WR : 1; /* [    5],         RW,        0x0 */
            uint16_t RD_ENDIAN       : 1; /* [    6],         RW,        0x1 */
            uint16_t WR_ENDIAN       : 1; /* [    7],         RW,        0x1 */
            uint16_t Reserved_13_8   : 6; /* [13: 8],       RSVD,        0x0 */
            uint16_t RD_OSTDG        : 1; /* [   14],         RW,        0x0 */
            uint16_t WR_OSTDG        : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CLOCK_AND_BURST_SIZE_SETUP;

    /* 0x10c : CE-ATA Register 1 */
    union {
        struct
        {
            uint16_t CPL_TIMEOUT    : 14; /* [13: 0],         RW,     0x3FFF */
            uint16_t Reserved_15_14 : 2;  /* [15:14],       RSVD,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CE_ATA_1;

    /* 0x10e : CE-ATA Register 2 */
    union {
        struct
        {
            uint16_t MISC_INT_INT_EN     : 1; /* [    0],         RW,        0x0 */
            uint16_t MISC_INT_EN         : 1; /* [    1],         RW,        0x0 */
            uint16_t MISC_INT            : 1; /* [    2],       RW1C,        0x0 */
            uint16_t Reserved_3          : 1; /* [    3],       RSVD,        0x0 */
            uint16_t CPL_COMPLETE_INT_EN : 1; /* [    4],         RW,        0x0 */
            uint16_t CPL_COMPLETE_EN     : 1; /* [    5],         RW,        0x0 */
            uint16_t CPL_COMPLETE        : 1; /* [    6],       RW1C,        0x0 */
            uint16_t Reserved_10_7       : 4; /* [10: 7],       RSVD,        0x0 */
            uint16_t MMC_RESETN          : 1; /* [   11],         RW,        0x1 */
            uint16_t MMC_CARD            : 1; /* [   12],         RW,        0x0 */
            uint16_t CEATA_CARD          : 1; /* [   13],         RW,        0x0 */
            uint16_t SND_CPL             : 1; /* [   14],         RW,        0x0 */
            uint16_t CHK_CPL             : 1; /* [   15],         RW,        0x0 */
        } BF;
        uint16_t SHORT;
    } SD_CE_ATA_2;

