XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/sdh_reg.h
    /* 0x110 : PAD I/O Setup Register */
    union {
        struct
        {
            uint32_t ASYNC_IO_EN    : 1;  /* [    0],         RW,        0x0 */
            uint32_t INAND_SEL      : 1;  /* [    1],         RW,        0x1 */
            uint32_t Reserved_15_2  : 14; /* [15: 2],       RSVD,        0x0 */
            uint32_t ECO_REG        : 8;  /* [23:16],         RW,        0x0 */
            uint32_t Reserved_31_24 : 8;  /* [31:24],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } SD_PAD_IO_SETUP;

    /* 0x114 : RX Configuration Register */
    union {
        struct
        {
            uint32_t SDCLK_SEL0     : 2;  /* [ 1: 0],         RW,        0x0 */
            uint32_t SDCLK_SEL1     : 2;  /* [ 3: 2],         RW,        0x0 */
            uint32_t Reserved_7_4   : 4;  /* [ 7: 4],       RSVD,        0x0 */
            uint32_t SDCLK_DELAY    : 10; /* [17: 8],         RW,        0x0 */
            uint32_t TUNING_DLY_INC : 10; /* [27:18],         RW,        0x0 */
            uint32_t Reserved_31_28 : 4;  /* [31:28],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } RX_CFG_REG;

    /* 0x118 : TX Configuration Register */
    union {
        struct
        {
            uint32_t TX_HOLD_DELAY0 : 10; /* [ 9: 0],         RW,       0x70 */
            uint32_t Reserved_15_10 : 6;  /* [15:10],       RSVD,        0x0 */
            uint32_t TX_HOLD_DELAY1 : 10; /* [25:16],         RW,       0x29 */
            uint32_t Reserved_29_26 : 4;  /* [29:26],       RSVD,        0x0 */
            uint32_t TX_INT_CLK_SEL : 1;  /* [   30],         RW,        0x0 */
            uint32_t TX_MUX_SEL     : 1;  /* [   31],         RW,        0x0 */
        } BF;
        uint32_t WORD;
    } TX_CFG_REG;

    /* 0x11c : TUNING CONFIG Register */
    union {
        struct
        {
            uint32_t TUNING_TT_CNT  : 8;  /* [ 7: 0],         RW,       0x27 */
            uint32_t TUNING_WD_CNT  : 6;  /* [13: 8],         RW,       0x0a */
            uint32_t TUNING_CLK_DLY : 10; /* [23:14],         RO,        0x0 */
            uint32_t
                TUNING_SUCCESS_CNT  : 6; /* [29:24],         RO,        0x0 */
            uint32_t Reserved_31_30 : 2; /* [31:30],       RSVD,        0x0 */
        } BF;
        uint32_t WORD;
    } TUNING_CFG_REG;
};

typedef volatile struct sdh_reg sdh_reg_t;

#endif /* __SDH_REG_H__ */
